
{
  "exercises": {
    "push-up": {
      "name": "تمرين الضغط",
      "description": "تمرين كلاسيكي بوزن الجسم يعمل على الصدر والكتفين والعضلة ثلاثية الرؤوس. حافظ على استقامة جسمك وجذعك مشدودًا."
    },
    "pull-up": {
      "name": "تمرين العقلة (قبضة واسعة)",
      "description": "تمرين متقدم بوزن الجسم يستهدف الظهر والعضلة ذات الرأسين باستخدام قبضة علوية."
    },
    "chin-up": {
      "name": "تمرين العقلة (قبضة ضيقة)",
      "description": "تمرين بوزن الجسم يستهدف الظهر والعضلة ذات الرأسين باستخدام قبضة سفلية، وغالبًا ما يركز على العضلة ذات الرأسين أكثر من تمرين العقلة العادي."
    },
    "bodyweight-squat": {
      "name": "سكوات بوزن الجسم",
      "description": "تمرين أساسي للجزء السفلي من الجسم يشغل عضلات الفخذ الأمامية، والأرداف، وأوتار الركبة بدون وزن خارجي."
    },
    "lunge": {
      "name": "تمرين الطعن",
      "description": "تمرين أحادي للساق يحسن التوازن والاستقرار ويقوي عضلات الفخذ الأمامية والأرداف وأوتار الركبة."
    },
    "plank": {
      "name": "تمرين البلانك",
      "description": "تمرين ثبات (أيزومتري) لقوة الجذع يتضمن الحفاظ على وضعية تشبه تمرين الضغط لأطول فترة ممكنة."
    },
    "burpee": {
      "name": "تمرين البيربي",
      "description": "تمرين عالي الكثافة لكامل الجسم يجمع بين السكوات، والضغط، والقفز."
    },
    "dip-bar": {
      "name": "تمرين الغطس (على المتوازي)",
      "description": "تمرين مركب بوزن الجسم يستهدف بشكل أساسي العضلة ثلاثية الرؤوس والصدر، ويتم إجراؤه على قضبان متوازية."
    },
    "barbell-bench-press": {
      "name": "تمرين ضغط البنش بالبار",
      "description": "تمرين مركب أساسي لقوة الجزء العلوي من الجسم، يستهدف بشكل أساسي الصدر والكتفين والعضلة ثلاثية الرؤوس."
    },
    "barbell-back-squat": {
      "name": "سكوات خلفي بالبار",
      "description": "تمرين قوة أساسي يستهدف عضلات الفخذ الأمامية والأرداف وأوتار الركبة وأسفل الظهر عن طريق أداء السكوات مع بار على الجزء العلوي من الظهر."
    },
    "barbell-deadlift": {
      "name": "الرفعة الميتة بالبار (التقليدية)",
      "description": "تمرين مركب لكامل الجسم يتضمن رفع بار من الأرض إلى وضع الوقوف، مما يشغل الساقين والظهر والجذع."
    },
    "overhead-press-barbell": {
      "name": "الضغط العلوي بالبار",
      "description": "تمرين مركب للكتف يتضمن ضغط البار فوق الرأس من وضع الوقوف أو الجلوس."
    },
    "bent-over-row-barbell": {
      "name": "تجديف بالبار في وضع الانحناء",
      "description": "تمرين مركب للظهر حيث يتم سحب البار نحو الجذع أثناء الانحناء عند الوركين."
    },
    "barbell-bicep-curl": {
      "name": "مرجحة البايسبس بالبار",
      "description": "تمرين عزل للعضلة ذات الرأسين (البايسبس) باستخدام البار."
    },
    "barbell-romanian-deadlift": {
      "name": "الرفعة الميتة الرومانية بالبار (RDL)",
      "description": "يستهدف أوتار الركبة والأرداف عن طريق المفصلة عند الوركين مع ثني طفيف في الركبة، مع إبقاء البار قريبًا من الساقين."
    },
    "dumbbell-bench-press": {
      "name": "ضغط البنش بالدمبل",
      "description": "تمرين مركب يستهدف الصدر والكتفين والعضلة ثلاثية الرؤوس باستخدام الدمبل على مقعد، مما يسمح بنطاق حركة أكبر."
    },
    "dumbbell-shoulder-press": {
      "name": "ضغط الكتف بالدمبل",
      "description": "تمرين مركب للكتف يتضمن ضغط الدمبل فوق الرأس، مما يسمح بحركة مستقلة للذراعين."
    },
    "dumbbell-row": {
      "name": "تجديف بالدمبل (ذراع واحدة)",
      "description": "تمرين أحادي للظهر يستهدف عضلات الظهر العريضة (اللاتس) والمعينية والبايسبس، ويتم إجراؤه عادةً مع ركبة ويد واحدة على مقعد."
    },
    "dumbbell-bicep-curl": {
      "name": "مرجحة البايسبس بالدمبل",
      "description": "تمرين عزل للبايسبس باستخدام الدمبل، مما يسمح بالاستلقاء (دوران المعصم)."
    },
    "dumbbell-tricep-extension-overhead": {
      "name": "مد الترايسبس بالدمبل فوق الرأس",
      "description": "تمرين عزل للعضلة ثلاثية الرؤوس (الترايسبس)، يتم إجراؤه عن طريق مد الدمبل فوق الرأس."
    },
    "dumbbell-lunge": {
      "name": "تمرين الطعن بالدمبل",
      "description": "تمرين الطعن مع حمل الدمبل، مما يضيف مقاومة للجزء السفلي من الجسم."
    },
    "dumbbell-romanian-deadlift": {
      "name": "الرفعة الميتة الرومانية بالدمبل (RDL)",
      "description": "يستهدف أوتار الركبة والأرداف باستخدام الدمبل، مع التركيز على حركة المفصلة عند الورك."
    },
    "goblet-squat": {
      "name": "سكوات الكأس",
      "description": "شكل من أشكال السكوات حيث يتم حمل دمبل واحد أو كرة حديدية (كيتل بيل) على مستوى الصدر، مما يعزز استقامة الجذع."
    },
    "dumbbell-lateral-raise": {
      "name": "رفرفة جانبية بالدمبل",
      "description": "تمرين عزل للعضلة الدالية الوسطى (الجانبية) للكتف، عن طريق رفع الدمبل إلى الجانبين."
    },
    "dumbbell-front-raise": {
      "name": "رفرفة أمامية بالدمبل",
      "description": "تمرين عزل للعضلة الدالية الأمامية للكتف، عن طريق رفع الدمبل إلى الأمام."
    },
    "kettlebell-swing": {
      "name": "أرجحة الكيتل بيل (بيدين)",
      "description": "تمرين ديناميكي ومتفجر يستهدف السلسلة الخلفية (الأرداف، أوتار الركبة، الظهر) ويحسن القوة."
    },
    "kettlebell-goblet-squat": {
      "name": "سكوات الكأس بالكيتل بيل",
      "description": "سكوات مع حمل الكيتل بيل من المقبضين على مستوى الصدر، ممتاز لتحسين الأداء وإشراك الجذع."
    },
    "kettlebell-clean-and-press": {
      "name": "خطف وضغط بالكيتل بيل",
      "description": "حركة مركبة لكامل الجسم تتضمن رفع الكيتل بيل إلى وضع الرف ثم ضغطه فوق الرأس."
    },
    "turkish-get-up": {
      "name": "النهضة التركية (TGU)",
      "description": "تمرين معقد لكامل الجسم يتضمن الانتقال من الاستلقاء على الأرض إلى الوقوف، كل ذلك أثناء حمل كيتل بيل (أو دمبل) فوق الرأس. يعزز الاستقرار والحركة والقوة."
    },
    "kettlebell-single-arm-row": {
      "name": "تجديف بذراع واحدة بالكيتل بيل",
      "description": "تمرين أحادي للظهر يستهدف عضلات الظهر العريضة، والمعينية، والبايسبس، يتم عن طريق سحب الكيتل بيل نحو الجذع، غالبًا مع دعم يد وركبة واحدة على مقعد."
    },
    "kettlebell-deadlift": {
      "name": "الرفعة الميتة بالكيتل بيل",
      "description": "تمرين قوة أساسي باستخدام كيتل بيل واحد أو اثنين لاستهداف السلسلة الخلفية، مع التركيز على حركة المفصلة عند الورك. يمكن إجراؤه مع الكيتل بيل بين القدمين أو خارجهما (أسلوب الحقيبة)."
    },
    "kettlebell-strict-press": {
      "name": "ضغط صارم بالكيتل بيل (ذراع واحدة)",
      "description": "تمرين ضغط علوي لقوة الكتف والترايسبس، يتم إجراؤه بكيتل بيل واحد من وضع الرف دون استخدام قوة الدفع من الساقين."
    },
    "kettlebell-rack-lunge": {
      "name": "تمرين الطعن بالكيتل بيل (وضع الرف)",
      "description": "تمرين أحادي للساق يبني القوة والاستقرار ومشاركة الجذع، يتم إجراؤه أثناء حمل كيتل بيل واحد أو اثنين في وضع الرف الأمامي."
    },
    "kettlebell-windmill": {
      "name": "تمرين الطاحونة بالكيتل بيل",
      "description": "تمرين معقد يحسن استقرار الكتف، وحركة الورك، وقوة الجذع، ويتضمن المفصلة الجانبية عند الوركين مع إبقاء الكيتل بيل مقفلاً فوق الرأس."
    },
    "kettlebell-russian-twist": {
      "name": "الالتواء الروسي بالكيتل بيل",
      "description": "تمرين للجذع يستهدف العضلات المائلة والمستقيمة البطنية، يتم إجراؤه بالجلوس مع ثني الركبتين ورفع القدمين عن الأرض (اختياري)، ولف الجذع من جانب إلى آخر أثناء حمل الكيتل بيل."
    },
    "kettlebell-high-pull": {
      "name": "سحب عالي بالكيتل بيل",
      "description": "تمرين متفجر يطور القوة في الوركين والظهر والكتفين. يتضمن سحب الكيتل بيل من وضع الأرجحة (أو الأرض) حتى ارتفاع الذقن، مع إبقاء الكوع مرتفعًا."
    },
    "kettlebell-figure-8": {
      "name": "تمرين الرقم 8 بالكيتل بيل",
      "description": "تمرين ديناميكي يحسن التنسيق، واستقرار الجذع، وقوة القبضة عن طريق تمرير الكيتل بيل بين وحول الساقين في حركة تشبه الرقم ثمانية."
    },
    "kettlebell-suitcase-carry": {
      "name": "حمل الحقيبة بالكيتل بيل",
      "description": "تمرين حمل أحادي الجانب يتحدى استقرار الجذع، وقوة القبضة، والقامة عن طريق حمل كيتل بيل ثقيل واحد في يد واحدة، مثل الحقيبة."
    },
    "kettlebell-thruster": {
      "name": "تمرين ثراستر بالكيتل بيل",
      "description": "تمرين مركب لكامل الجسم يجمع بين سكوات أمامي بالكيتل بيل وضغط علوي في حركة واحدة سلسة. يمكن إجراؤه بكيتل بيل واحد أو اثنين."
    },
    "lat-pulldown-machine": {
      "name": "سحب أمامي (على الجهاز)",
      "description": "تمرين يعتمد على الجهاز يستهدف عضلات الظهر العريضة (اللاتس) عن طريق سحب شريط نحو الصدر."
    },
    "seated-row-machine": {
      "name": "تجديف جالس (على الجهاز)",
      "description": "تمرين على الجهاز لزيادة سماكة الظهر، يستهدف عضلات منتصف الظهر عن طريق سحب المقابض نحو الجذع."
    },
    "leg-press-machine": {
      "name": "ضغط الأرجل (على الجهاز)",
      "description": "تمرين مركب للجزء السفلي من الجسم يتم على جهاز، عن طريق دفع منصة محملة بالوزن بعيدًا باستخدام الساقين."
    },
    "leg-extension-machine": {
      "name": "مد الأرجل (على الجهاز)",
      "description": "تمرين عزل لعضلات الفخذ الأمامية، عن طريق مد الساقين السفليتين ضد المقاومة."
    },
    "leg-curl-machine": {
      "name": "ثني الأرجل (على الجهاز - مستلقياً أو جالسًا)",
      "description": "تمرين عزل لأوتار الركبة، عن طريق ثني الساقين السفليتين نحو الأرداف ضد المقاومة."
    },
    "chest-press-machine": {
      "name": "ضغط الصدر (على الجهاز)",
      "description": "تمرين مركب للصدر يعتمد على الجهاز، يشبه ضغط البنش ولكن بمسار حركة ثابت."
    },
    "shoulder-press-machine": {
      "name": "ضغط الكتف (على الجهاز)",
      "description": "تمرين على الجهاز للكتفين، عن طريق ضغط المقابض فوق الرأس بحركة موجهة."
    },
    "pec-deck-fly-machine": {
      "name": "رفرفة الفراشة (على الجهاز)",
      "description": "تمرين عزل للصدر، عن طريق جمع الذراعين معًا في حركة رفرفة باستخدام جهاز."
    },
    "reverse-pec-deck-machine": {
      "name": "رفرفة الفراشة العكسية (للдельтовид الخلفي)",
      "description": "تمرين على الجهاز يستهدف العضلة الدالية الخلفية (الكتفين الخلفيين) وعضلات الظهر العلوية."
    },
    "calf-raise-machine": {
      "name": "رفع السمانة (على الجهاز - واقفًا أو جالسًا)",
      "description": "تمرين عزل لعضلات السمانة (العضلة التوأمية الساقية والنعلية)."
    },
    "cable-tricep-pushdown": {
      "name": "ضغط الترايسبس بالكابل (بالحبل أو البار)",
      "description": "تمرين عزل للعضلة ثلاثية الرؤوس (الترايسبس) باستخدام جهاز الكابل مع ملحق حبل أو بار."
    },
    "cable-bicep-curl": {
      "name": "مرجحة البايسبس بالكابل (بالبار أو المقابض)",
      "description": "تمرين عزل للبايسبس باستخدام جهاز الكابل، مما يوفر توترًا مستمرًا."
    },
    "cable-face-pull": {
      "name": "سحب الوجه بالكابل",
      "description": "تمرين ممتاز للعضلة الدالية الخلفية، وصحة الكفة المدورة، ووضعية الظهر العلوية."
    },
    "cable-fly": {
      "name": "رفرفة بالكابل (واقفًا - مرتفع، متوسط، أو منخفض)",
      "description": "تمرين عزل للصدر باستخدام جهاز الكابل، مما يسمح بزوايا مختلفة لاستهداف أجزاء مختلفة من الصدر."
    },
    "cable-lateral-raise": {
      "name": "رفرفة جانبية بالكابل",
      "description": "تمرين عزل للعضلة الدالية الوسطى باستخدام الكابل، مما يوفر توترًا مستمرًا طوال الحركة."
    },
    "cable-woodchop": {
      "name": "تقطيع الخشب بالكابل (من الأعلى للأسفل أو من الأسفل للأعلى)",
      "description": "تمرين دوراني للجذع يشغل العضلات المائلة والبطنية المستعرضة."
    },
    "resistance-band-bicep-curl": {
      "name": "مرجحة البايسبس بشريط المقاومة",
      "description": "مرجحة البايسبس تتم بشريط مقاومة، مما يوفر مقاومة متغيرة."
    },
    "resistance-band-tricep-pushdown": {
      "name": "ضغط الترايسبس بشريط المقاومة",
      "description": "ضغط الترايسبس باستخدام شريط مقاومة مثبت في الأعلى أو ممسوك."
    },
    "resistance-band-pull-apart": {
      "name": "سحب شريط المقاومة",
      "description": "تمرين رائع لصحة الكتف، يستهدف العضلة الدالية الخلفية وعضلات الظهر العلوية."
    },
    "resistance-band-squat": {
      "name": "سكوات بشريط المقاومة",
      "description": "سكوات يتم بشريط مقاومة تحت القدمين وملفوف فوق الكتفين أو ممسوك، مما يضيف مقاومة."
    },
    "resistance-band-glute-bridge": {
      "name": "جسر الأرداف بشريط المقاومة",
      "description": "جسر الأرداف مع شريط مقاومة حول الفخذين لتنشيط إضافي للعضلة الألوية الوسطى."
    },
    "farmers-walk": {
      "name": "مشي المزارع",
      "description": "تمرين لكامل الجسم يتضمن المشي لمسافة مع حمل أوزان ثقيلة (دمبل، كيتل بيل، أو مقابض مشي المزارع). يحسن قوة القبضة، واستقرار الجذع، والتكيف العام."
    },
    "box-jump": {
      "name": "قفز الصندوق",
      "description": "تمرين بليومتري يتضمن القفز على منصة مرتفعة، مما يطور القوة الانفجارية في الجزء السفلي من الجسم."
    },
    "medicine-ball-slam": {
      "name": "ضرب الكرة الطبية",
      "description": "تمرين قوة لكامل الجسم يتضمن رفع كرة طبية فوق الرأس وضربها بقوة على الأرض."
    },
    "glute-bridge": {
      "name": "جسر الأرداف",
      "description": "تمرين بوزن الجسم يستهدف الأرداف وأوتار الركبة عن طريق رفع الوركين عن الأرض."
    },
    "superman-exercise": {
      "name": "تمرين سوبرمان",
      "description": "تمرين بوزن الجسم يقوي أسفل الظهر والأرداف وأوتار الركبة عن طريق رفع الذراعين والساقين في وقت واحد عن الأرض أثناء الاستلقاء على البطن."
    },
    "mountain-climbers": {
      "name": "متسلق الجبال",
      "description": "تمرين ديناميكي لكامل الجسم يبني القدرة على التحمل القلبي، وقوة الجذع، والرشاقة، محاكيًا حركة تسلق الجبل."
    },
    "bench-dips": {
      "name": "غطس على المقعد (للترايسبس)",
      "description": "تمرين بوزن الجسم يستهدف العضلة ثلاثية الرؤوس (الترايسبس)، يتم إجراؤه باستخدام مقعد أو كرسي."
    },
    "bodyweight-calf-raise": {
      "name": "رفع السمانة بوزن الجسم",
      "description": "تمرين بسيط وفعال بوزن الجسم لتقوية عضلات السمانة."
    },
    "barbell-hip-thrust": {
      "name": "دفع الورك بالبار",
      "description": "تمرين قوي للأرداف يتم عن طريق دفع الوركين لأعلى مع بار على الحضن، وعادة ما يكون الجزء العلوي من الظهر مدعومًا على مقعد."
    },
    "barbell-front-squat": {
      "name": "سكوات أمامي بالبار",
      "description": "شكل من أشكال السكوات حيث يتم حمل البار على الجزء الأمامي من الكتفين، مع التركيز على عضلات الفخذ الأمامية واستقرار الجذع."
    },
    "barbell-good-morning": {
      "name": "تمرين صباح الخير بالبار",
      "description": "تمرين يستهدف السلسلة الخلفية (أوتار الركبة، الأرداف، أسفل الظهر) عن طريق المفصلة عند الوركين مع بار على الجزء العلوي من الظهر."
    },
    "dumbbell-incline-press": {
      "name": "ضغط مائل بالدمبل",
      "description": "يستهدف الجزء العلوي من الصدر والكتفين والترايسبس عن طريق ضغط الدمبل على مقعد مائل."
    },
    "dumbbell-fly": {
      "name": "رفرفة بالدمبل",
      "description": "تمرين عزل للصدر، يتم عن طريق فتح وإغلاق الذراعين في حركة قوسية أثناء حمل الدمبل."
    },
    "dumbbell-hammer-curl": {
      "name": "مرجحة المطرقة بالدمبل",
      "description": "شكل من أشكال مرجحة البايسبس بقبضة محايدة (راحة اليدين تواجه بعضها البعض)، تستهدف العضلة العضدية والعضدية الكعبرية بالإضافة إلى البايسبس."
    },
    "dumbbell-tricep-kickback": {
      "name": "رفس الترايسبس بالدمبل للخلف",
      "description": "تمرين عزل للترايسبس، يتم عن طريق مد الذراع للخلف أثناء الانحناء عند الوركين."
    },
    "dumbbell-bulgarian-split-squat": {
      "name": "سكوات بلغاري منفصل بالدمبل",
      "description": "تمرين أحادي للساق مع رفع القدم الخلفية، يستهدف عضلات الفخذ الأمامية والأرداف وأوتار الركبة مع تحسين التوازن."
    },
    "dumbbell-pullover": {
      "name": "سحب البلوفر بالدمبل",
      "description": "تمرين يعمل على الصدر والظهر العريض (اللاتس)، يتم بالاستلقاء على مقعد وخفض الدمبل خلف الرأس."
    },
    "kettlebell-snatch": {
      "name": "خطف الكيتل بيل",
      "description": "تمرين متفجر لكامل الجسم حيث يتم أرجحة الكيتل بيل من بين الساقين إلى وضع القفل العلوي في حركة واحدة سلسة."
    },
    "kettlebell-halo": {
      "name": "هالة الكيتل بيل",
      "description": "تمرين لحركة واستقرار الكتف يتضمن تدوير الكيتل بيل حول الرأس."
    },
    "hack-squat-machine": {
      "name": "هاك سكوات (على الجهاز)",
      "description": "شكل من أشكال السكوات يعتمد على الجهاز يستهدف عضلات الفخذ الأمامية، غالبًا مع التركيز على الجزء الخارجي من عضلات الفخذ."
    },
    "seated-calf-raise-machine": {
      "name": "رفع السمانة جالسًا (على الجهاز)",
      "description": "تمرين عزل للعضلة النعلية في السمانة، يتم على جهاز جلوس."
    },
    "abdominal-crunch-machine": {
      "name": "كرنش البطن (على الجهاز)",
      "description": "تمرين يعتمد على الجهاز لعزل عضلات البطن المستقيمة."
    },
    "back-extension-machine": {
      "name": "مد الظهر (جهاز التمدد الفائق)",
      "description": "يقوي أسفل الظهر والأرداف وأوتار الركبة باستخدام مقعد أو جهاز التمدد الفائق."
    },
    "cable-overhead-tricep-extension": {
      "name": "مد الترايسبس العلوي بالكابل (بالحبل)",
      "description": "يستهدف الرأس الطويل للعضلة ثلاثية الرؤوس (الترايسبس) باستخدام جهاز الكابل وملحق الحبل."
    },
    "cable-pull-through": {
      "name": "سحب الكابل من بين الأرجل",
      "description": "تمرين مفصلة الورك يستهدف الأرداف وأوتار الركبة باستخدام جهاز الكابل."
    },
    "cable-reverse-fly": {
      "name": "رفرفة عكسية بالكابل",
      "description": "يستهدف العضلة الدالية الخلفية وعضلات الظهر العلوية باستخدام جهاز الكابل ببكرات مزدوجة."
    },
    "cable-torso-twist": {
      "name": "لف الجذع بالكابل (واقفًا)",
      "description": "تمرين للجذع يستهدف العضلات المائلة من خلال الحركة الدورانية ضد مقاومة الكابل."
    },
    "resistance-band-chest-press": {
      "name": "ضغط الصدر بشريط المقاومة",
      "description": "شكل من أشكال ضغط الصدر باستخدام أشرطة المقاومة، يمكن إجراؤه واقفًا أو مستلقيًا."
    },
    "resistance-band-row": {
      "name": "تجديف بشريط المقاومة (جالسًا أو واقفًا)",
      "description": "يستهدف عضلات الظهر باستخدام شريط مقاومة، يمكن تثبيته أو مسكه."
    },
    "resistance-band-deadlift": {
      "name": "الرفعة الميتة بشريط المقاومة",
      "description": "شكل من أشكال الرفعة الميتة باستخدام أشرطة المقاومة، جيد لتعلم الأداء الصحيح أو للأيام الخفيفة."
    },
    "resistance-band-lateral-walk": {
      "name": "مشي جانبي بشريط المقاومة (مشي السلطعون)",
      "description": "يستهدف العضلة الألوية الوسطى ومبعدات الورك، يتم بالمشي جانبيًا مع شريط حول الكاحلين أو الركبتين."
    },
    "hamstring-stretch": {
      "name": "إطالة أوتار الركبة (واقفًا/جالسًا)",
      "description": "إطالة ثابتة لتحسين المرونة في عضلات أوتار الركبة."
    },
    "quadriceps-stretch": {
      "name": "إطالة عضلات الفخذ الأمامية (واقفًا)",
      "description": "إطالة ثابتة لعضلات الفخذ الأمامية، تتم عادة بسحب الكعب نحو الأرداف."
    },
    "chest-stretch-doorway": {
      "name": "إطالة الصدر (في المدخل)",
      "description": "إطالة ثابتة للعضلات الصدرية باستخدام مدخل الباب للرافعة."
    },
    "triceps-stretch": {
      "name": "إطالة الترايسبس (فوق الرأس)",
      "description": "إطالة ثابتة للترايسبس، تتم بمد ذراع واحدة فوق الرأس وثني الكوع."
    },
    "cat-cow-stretch": {
      "name": "إطالة القطة والبقرة",
      "description": "إطالة ديناميكية تحسن حركة العمود الفقري وتخفف التوتر في الظهر والجذع."
    },
    "childs-pose": {
      "name": "وضعية الطفل",
      "description": "وضعية استرخاء لطيفة تهدئ العقل وتساعد على تخفيف التوتر والإرهاق. تمدد بلطف الوركين والفخذين والكاحلين."
    },
    "jumping-jacks": {
      "name": "قفزات جاك",
      "description": "تمرين رياضي كلاسيكي لكامل الجسم يعمل كإحماء جيد أو دفعة كارديو."
    },
    "high-knees": {
      "name": "ركب عالية",
      "description": "تمرين عالي الكثافة للقلب يتضمن الجري في المكان مع رفع الركبتين لأعلى مستوى ممكن."
    },
    "running-jogging": {
      "name": "الجري/الهرولة",
      "description": "تمرين فعال للقلب والأوعية الدموية يحسن القدرة على التحمل ويحرق السعرات الحرارية."
    },
    "cycling": {
      "name": "ركوب الدراجات",
      "description": "تمرين منخفض التأثير للقلب والأوعية الدموية يعمل بشكل أساسي على عضلات الساقين."
    },
    "jump-rope": {
      "name": "نط الحبل",
      "description": "تمرين فعال للغاية للقلب والأوعية الدموية يحسن التنسيق والرشاقة ويحرق كمية كبيرة من السعرات الحرارية."
    },
    "elliptical-trainer": {
      "name": "الجهاز الإهليلجي (الأوبتيكال)",
      "description": "جهاز كارديو منخفض التأثير يحاكي صعود السلالم أو المشي أو الجري دون التسبب في ضغط مفرط على المفاصل."
    },
    "stair-climbing": {
      "name": "صعود السلالم",
      "description": "تمرين قوي للقلب والأوعية الدموية يستهدف الأرداف وعضلات الفخذ الأمامية وأوتار الركبة."
    },
    "sled-push": {
      "name": "دفع الزلاجة",
      "description": "تمرين قوة وتكييف لكامل الجسم يتضمن دفع زلاجة محملة بالوزن."
    },
    "sled-pull": {
      "name": "سحب الزلاجة",
      "description": "تمرين قوة وتكييف لكامل الجسم يتضمن سحب زلاجة محملة بالوزن باستخدام أشرطة أو حزام."
    },
    "tire-flip": {
      "name": "قلب الإطار",
      "description": "تمرين قوي لكامل الجسم شائع في تدريب الأقوياء، يتضمن قلب إطار كبير."
    },
    "battle-ropes": {
      "name": "الحبال الثقيلة",
      "description": "تمرين عالي الكثافة ومنخفض التأثير يعمل على الجزء العلوي من الجسم والجذع ويوفر تحديًا للقلب والأوعية الدموية."
    }
  },



    "alternating-proprioceptive-reverse-lunge": {
      "name": "الطعن العكسي التبادلي لتحسين استقبال الحس العميق",
      "description": "شكل من أشكال تمرين الطعن العكسي يتحدى التوازن والوعي بالجسم عن طريق تبديل الساقين مع كل تكرار، وغالبًا ما يتم على سطح غير مستقر أو مع إغماض العينين لتعزيز استقبال الحس العميق."
    },
    "rehab-ankle-pumps": {
      "name": "ضخ الكاحل",
      "description": "تمرين حركي بسيط يتضمن ثني ومد الكاحلين، وغالبًا ما يستخدم لتحسين الدورة الدموية ونطاق الحركة بعد الإصابة أو عدم النشاط."
    },
    "archer-push-up": {
      "name": "ضغط الرامي",
      "description": "شكل من أشكال تمرين الضغط أحادي الجانب حيث تمتد إحدى الذراعين إلى الجانب بينما تقوم الأخرى بتمرين الضغط، مما يبني القوة والتحكم في جانب واحد في كل مرة."
    },
    "barbell-skull-crusher": {
      "name": "سحق الجمجمة بالبار",
      "description": "تمرين عزل للعضلة ثلاثية الرؤوس، يتم بالاستلقاء على مقعد وخفض البار باتجاه الجبين قبل مد المرفقين."
    },
    "bird-dog": {
      "name": "تمرين الطائر والكلب",
      "description": "تمرين لاستقرار الجذع حيث تقوم بمد ذراع وساق متعاكسين في نفس الوقت وأنت على أربع، مما يحسن التوازن واستقرار العمود الفقري."
    },
    "rehab-bird-dog-stability": {
      "name": "تمرين الطائر والكلب (تركيز على الثبات)",
      "description": "شكل من أشكال تمرين الطائر والكلب يركز على الحركات البطيئة والمتحكم بها والثبات لزيادة استقرار الجذع والتحكم فيه إلى أقصى حد."
    },
    "bulgarian-bag-arm-throw": {
      "name": "رمي الذراع بالحقيبة البلغارية",
      "description": "تمرين دوراني ديناميكي باستخدام الحقيبة البلغارية، يتضمن تأرجح ورمي الحقيبة عبر الجسم لتطوير قوة الجذع والتنسيق."
    },
    "bulgarian-bag-snatch": {
      "name": "خطف بالحقيبة البلغارية",
      "description": "حركة متفجرة لكامل الجسم حيث يتم تأرجح الحقيبة البلغارية من بين الساقين إلى وضع علوي في حركة واحدة سلسة."
    },
    "bulgarian-bag-spin": {
      "name": "دوران بالحقيبة البلغارية",
      "description": "تمرين مميز بالحقيبة البلغارية يتضمن تدوير الحقيبة حول الرأس والجسم، مما يبني استقرار الكتف وقوة الجذع والقبضة."
    },
    "bulgarian-bag-suplex": {
      "name": "سوبلكس بالحقيبة البلغارية",
      "description": "تمرين يركز على القوة ويحاكي حركة السوبلكس في المصارعة، ويتضمن رفع ورمي الحقيبة البلغارية فوق الكتف."
    },
    "burpee-box-jump": {
      "name": "بيربي مع قفز الصندوق",
      "description": "شكل عالي الكثافة من تمرين البيربي حيث يتم أداء القفزة النهائية على صندوق مرتفع، مما يزيد من الطلب البليومتري."
    },
    "cable-seated-row": {
      "name": "تجديف جالس بالكابل",
      "description": "تمرين على الجهاز لزيادة سماكة الظهر، يستهدف عضلات منتصف الظهر عن طريق سحب المقابض نحو الجذع من وضع الجلوس."
    },
    "calf-stretch": {
      "name": "إطالة السمانة",
      "description": "تمرين مرونة لإطالة عضلات الساق الخلفية (التوأمية الساقية والنعلية)، يتم عادةً مقابل جدار أو على درجة."
    },
    "chin-tucks-cervical-retraction": {
      "name": "سحب الذقن (سحب عنقي)",
      "description": "تمرين للقامة لتصحيح وضعية الرأس الأمامية عن طريق سحب الرأس والرقبة بلطف، مما يقوي عضلات الرقبة العميقة القابضة."
    },
    "rehab-clamshells": {
      "name": "تمرين الصدفة",
      "description": "تمرين لتبعيد الورك يتم أثناء الاستلقاء على جانبك لتقوية العضلة الألوية الوسطى، وهو أمر حاسم لاستقرار الورك."
    },
    "clubbell-barbarian-squat": {
      "name": "سكوات البربري بالكلوب بيل",
      "description": "تمرين معقد يجمع بين السكوات وحركات الكلوب بيل الدورانية، ويتحدى التنسيق وقوة الجذع وقوة الجزء السفلي من الجسم."
    },
    "clubbell-gamma-cast": {
      "name": "رمية جاما بالكلوب بيل",
      "description": "تمرين أساسي بالكلوب بيل يتضمن تأرجحًا بندوليًا من جانب إلى آخر أمام الجسم، مما يبني قوة القبضة والكتف والجذع."
    },
    "clubbell-mill": {
      "name": "تمرين الطاحونة بالكلوب بيل",
      "description": "تمرين قوة دائري حيث يتم تأرجح الكلوب بيل في نمط دوراني حول الجسم، على غرار حركة الطاحونة الهوائية، مما يحسن حركة واستقرار الكتف."
    },
    "clubbell-shield-cast": {
      "name": "رمية الدرع بالكلوب بيل",
      "description": "حركة أساسية بالكلوب بيل حيث يتم رمي الجرس فوق الكتف في حركة 'درع' واقية، وهي رائعة لحركة الكتف والصدر."
    },
    "crab-walk": {
      "name": "مشي السلطعون",
      "description": "تمرين بوزن الجسم يتم عن طريق المشي على اليدين والقدمين مع توجيه الصدر لأعلى، مما يشغل العضلة ثلاثية الرؤوس والكتفين والأرداف وأوتار الركبة."
    },
    "dead-bug": {
      "name": "تمرين الحشرة الميتة",
      "description": "تمرين للجذع حيث تستلقي على ظهرك وتخفض ببطء ذراعين وساقين متعاكسين، مما يحسن استقرار منطقة أسفل الظهر والحوض دون إجهاد الظهر."
    },
    "decline-push-up": {
      "name": "ضغط منحدر",
      "description": "شكل من أشكال تمرين الضغط مع رفع القدمين، مما يزيد الحمل على الجزء العلوي من الصدر والكتفين."
    },
    "dolphin-plank": {
      "name": "بلانك الدلفين",
      "description": "شكل متقدم من تمرين البلانك يتم على الساعدين، ويتضمن رفع الوركين لأعلى ولأسفل لتحدي الكتفين والجذع."
    },
    "double-kettlebell-alternating-clean": {
      "name": "خطف تبادلي بالكيتل بيل المزدوج",
      "description": "تمرين يتم فيه حمل اثنين من الكيتل بيل، حيث تقوم بالتبديل في رفعهما إلى وضع الرف، مما يتحدى التنسيق واستقرار الجذع."
    },
    "double-kettlebell-alternating-floor-press": {
      "name": "ضغط أرضي تبادلي بالكيتل بيل المزدوج",
      "description": "ضغط أرضي باستخدام اثنين من الكيتل بيل، حيث تضغط بذراع واحدة في كل مرة، مما يجبر الجذع على مقاومة الدوران."
    },
    "double-kettlebell-alternating-rotational-press": {
      "name": "ضغط دوراني تبادلي بالكيتل بيل المزدوج",
      "description": "ضغط علوي باثنين من الكيتل بيل، يتضمن دوران الجذع أثناء ضغط كل جرس لأعلى واحدًا تلو الآخر."
    },
    "double-kettlebell-alternating-snatch": {
      "name": "خطف تبادلي بالكيتل بيل المزدوج",
      "description": "تمرين متفجر حيث تقوم بالتبديل في خطف كل كيتل بيل فوق الرأس في حركة مستمرة وسلسة."
    },
    "double-kettlebell-arching-swing": {
      "name": "أرجحة مقوسة بالكيتل بيل المزدوج",
      "description": "شكل من أشكال الأرجحة حيث يتم تأرجح اثنين من الكيتل بيل في مسار مقوس خارج الساقين، مما يتحدى الوركين والجذع بشكل مختلف عن الأرجحة القياسية."
    },
    "double-kettlebell-bent-over-row": {
      "name": "تجديف منحني بالكيتل بيل المزدوج",
      "description": "تمرين قوة للظهر، يتم عن طريق أداء تجديف منحني أثناء حمل كيتل بيل في كل يد."
    },
    "double-kettlebell-clean": {
      "name": "خطف بالكيتل بيل المزدوج",
      "description": "تمرين قوة حيث يتم رفع اثنين من الكيتل بيل في وقت واحد من وضع الأرجحة إلى وضع الرف على الصدر."
    },
    "double-kettlebell-clean-and-jerk": {
      "name": "خطف ونتر بالكيتل بيل المزدوج",
      "description": "رفعة باليستية لكامل الجسم تجمع بين الخطف المزدوج بالكيتل بيل ونترة قوية لدفع كلا الجرسين فوق الرأس."
    },
    "double-kettlebell-clean-and-push-press": {
      "name": "خطف ودفع بالكيتل بيل المزدوج",
      "description": "حركة مركبة تجمع بين الخطف المزدوج بالكيتل بيل والضغط بالدفع، باستخدام قوة دفع الساق للمساعدة في ضغط الأجراس فوق الرأس."
    },
    "double-kettlebell-clean-to-reverse-lunge": {
      "name": "خطف إلى طعن عكسي بالكيتل بيل المزدوج",
      "description": "مجموعة مركبة تجمع بين خطف مزدوج بالكيتل بيل وطعن عكسي على كل ساق قبل التكرار."
    },
    "double-kettlebell-complex-clean-squat-press": {
      "name": "مجموعة مركبة بالكيتل بيل المزدوج (خطف-سكوات-ضغط)",
      "description": "تسلسل تقوم فيه بأداء خطف مزدوج بالكيتل بيل، يليه سكوات أمامي، ثم ضغط علوي في مجموعة واحدة مستمرة."
    },
    "double-kettlebell-deadlift-to-swing": {
      "name": "رفعة ميتة إلى أرجحة بالكيتل بيل المزدوج",
      "description": "تمرين يبدأ برفعة ميتة مزدوجة بالكيتل بيل ويتدفق مباشرة إلى أرجحة كيتل بيل، مما يساعد على تشكيل نمط مفصلة الورك."
    },
    "double-kettlebell-farmers-squat": {
      "name": "سكوات المزارع بالكيتل بيل المزدوج",
      "description": "شكل من أشكال السكوات يتم أثناء حمل اثنين من الكيتل بيل على جانبيك (وضعية حمل المزارع)، مما يشغل بشكل كبير عضلات الترابيس والجذع."
    },
    "double-kettlebell-floor-press": {
      "name": "ضغط أرضي بالكيتل بيل المزدوج",
      "description": "تمرين للصدر والترايسبس يتم عن طريق الاستلقاء على الأرض وضغط اثنين من الكيتل بيل لأعلى. تحد الأرض من نطاق الحركة، مع التركيز على قوة القفل."
    },
    "double-kettlebell-front-squat": {
      "name": "سكوات أمامي بالكيتل بيل المزدوج",
      "description": "سكوات يتم أثناء حمل اثنين من الكيتل بيل في وضع الرف الأمامي، مما يتحدى بشدة عضلات الفخذ الأمامية والأرداف والجذع."
    },
    "double-kettlebell-front-squat-to-press-out": {
      "name": "سكوات أمامي إلى ضغط للخارج بالكيتل بيل المزدوج",
      "description": "يجمع بين سكوات أمامي مزدوج بالكيتل بيل وضغط ثابت للخارج في أسفل السكوات، مما يزيد من إشراك الجذع والكتف."
    },
    "double-kettlebell-gorilla-row": {
      "name": "تجديف الغوريلا بالكيتل بيل المزدوج",
      "description": "تمرين تجديف تبادلي يتم من وضعية مفصلة ورك عميقة مع وجود اثنين من الكيتل بيل على الأرض، لبناء قوة واستقرار الظهر."
    },
    "double-kettlebell-offset-carry-overhead-rack": {
      "name": "حمل غير متماثل بالكيتل بيل المزدوج (فوق الرأس/رف)",
      "description": "حمل محمل حيث يتم حمل كيتل بيل واحد فوق الرأس والآخر في وضع الرف، مما يخلق تحديًا كبيرًا لاستقرار الجذع والكتف."
    },
    "double-kettlebell-offset-squat-rack-suitcase": {
      "name": "سكوات غير متماثل بالكيتل بيل المزدوج (رف/حقيبة)",
      "description": "سكوات يتم أثناء حمل كيتل بيل واحد في وضع الرف والآخر في وضع الحقيبة (على جانبك)، مما يتحدى مقاومة الانثناء الجانبي."
    },
    "double-kettlebell-overhead-carry": {
      "name": "حمل علوي بالكيتل بيل المزدوج",
      "description": "حمل محمل يتضمن المشي أثناء حمل اثنين من الكيتل بيل مقفلين فوق الرأس، مما يبني استقرارًا هائلاً للكتف والجذع."
    },
    "double-kettlebell-overhead-lunge": {
      "name": "طعن علوي بالكيتل بيل المزدوج",
      "description": "طعن يتم أثناء حمل اثنين من الكيتل بيل فوق الرأس، ويتطلب استقرارًا وقوة كبيرة لكامل الجسم."
    },
    "double-kettlebell-press": {
      "name": "ضغط علوي بالكيتل بيل المزدوج",
      "description": "تمرين قوة للكتف يتضمن ضغط اثنين من الكيتل بيل من وضع الرف إلى الأعلى."
    },
    "double-kettlebell-push-press": {
      "name": "ضغط بالدفع بالكيتل بيل المزدوج",
      "description": "ضغط علوي متفجر يستخدم غطسة ودفع من الساقين للمساعدة في دفع اثنين من الكيتل بيل فوق الرأس."
    },
    "double-kettlebell-push-up-to-renegade-row": {
      "name": "ضغط إلى تجديف منشق بالكيتل بيل المزدوج",
      "description": "مجموعة مركبة تتضمن تمرين ضغط على اثنين من الكيتل بيل، يليه تجديف كل كيتل بيل إلى الصدر واحدًا تلو الآخر."
    },
    "double-kettlebell-rack-deadlift": {
      "name": "رفعة ميتة من وضع الرف بالكيتل بيل المزدوج",
      "description": "شكل من أشكال الرفعة الميتة حيث يتم حمل الكيتل بيل في وضع الرف الأمامي، مما يضع تركيزًا كبيرًا على عضلات الفخذ الأمامية والجذع."
    },
    "double-kettlebell-renegade-row": {
      "name": "تجديف منشق بالكيتل بيل المزدوج",
      "description": "من وضعية بلانك على اثنين من الكيتل بيل، تقوم بالتبديل في تجديف كل جرس إلى صدرك، مما يتحدى استقرار الجذع وقوة الظهر."
    },
    "double-kettlebell-rotational-press": {
      "name": "ضغط دوراني بالكيتل بيل المزدوج",
      "description": "ضغط علوي يتضمن محورًا ودورانًا للجذع لتوليد القوة."
    },
    "double-kettlebell-see-saw-press": {
      "name": "ضغط متأرجح بالكيتل بيل المزدوج",
      "description": "ضغط علوي تبادلي حيث يرتفع أحد الكيتل بيل بينما ينزل الآخر، مما يخلق توترًا مستمرًا وتحديًا للاستقرار."
    },
    "double-kettlebell-see-saw-row": {
      "name": "تجديف متأرجح بالكيتل بيل المزدوج",
      "description": "تجديف منحني تبادلي حيث يتم تجديف أحد الكيتل بيل لأعلى بينما يتم إنزال الآخر، مما يتحدى الظهر والجذع."
    },
    "double-kettlebell-snatch": {
      "name": "خطف بالكيتل بيل المزدوج",
      "description": "حركة رياضية عالية حيث يتم تأرجح اثنين من الكيتل بيل ودفعهما إلى قفل علوي في حركة متفجرة واحدة."
    },
    "double-kettlebell-split-jerk": {
      "name": "نتر منفصل بالكيتل بيل المزدوج",
      "description": "شكل قوي من أشكال النتر حيث تقوم بالغطس والدفع والهبوط تحت الكيتل بيل في وضعية منفصلة لاستقبالهما فوق الرأس."
    },
    "double-kettlebell-split-snatch": {
      "name": "خطف منفصل بالكيتل بيل المزدوج",
      "description": "شكل متقدم من أشكال الخطف حيث تلتقط اثنين من الكيتل بيل فوق الرأس عن طريق تحريك قدميك إلى وضعية منفصلة."
    },
    "double-kettlebell-suitcase-deadlift": {
      "name": "رفعة ميتة بوضعية الحقيبة بالكيتل بيل المزدوج",
      "description": "رفعة ميتة تتم مع كيتل بيل على الجانب الخارجي لكل قدم، مما يتحدى الساقين والظهر واستقرار الجذع."
    },
    "double-kettlebell-sumo-deadlift": {
      "name": "رفعة ميتة سومو بالكيتل بيل المزدوج",
      "description": "رفعة ميتة تتم بوقفة واسعة (سومو)، مع حمل اثنين من الكيتل بيل بين الساقين، مع التركيز على الأرداف والوركين."
    },
    "double-kettlebell-thruster": {
      "name": "ثراستر بالكيتل بيل المزدوج",
      "description": "تمرين مركب لكامل الجسم يجمع بين سكوات أمامي مزدوج بالكيتل بيل وضغط علوي في حركة واحدة سلسة."
    },
    "double-kettlebell-walking-lunge": {
      "name": "طعن مشي بالكيتل بيل المزدوج",
      "description": "طعن مشي يتم أثناء حمل اثنين من الكيتل بيل، عادة في وضع الرف أو المزارع، لإضافة حمولة كبيرة."
    },
    "double-kettlebell-windmill": {
      "name": "طاحونة بالكيتل بيل المزدوج",
      "description": "شكل متقدم من تمرين الطاحونة حيث تحمل كيتل بيل واحدًا فوق الرأس وتنحني لالتقاط الثاني من الأرض، مما يتطلب استقرارًا وحركة هائلين."
    },
    "dumbbell-arnold-press": {
      "name": "ضغط أرنولد بالدمبل",
      "description": "شكل من أشكال ضغط الكتف يتضمن دورانًا لتمرين جميع رؤوس العضلة الدالية الثلاثة."
    },
    "dumbbell-concentration-curl": {
      "name": "مرجحة التركيز بالدمبل",
      "description": "مرجحة بايسبس جالسة حيث يتم إسناد الكوع على الفخذ الداخلي لعزل عضلة البايسبس."
    },
    "dumbbell-incline-bench-press": {
      "name": "ضغط بنش مائل بالدمبل",
      "description": "يستهدف الجزء العلوي من الصدر والكتفين والترايسبس عن طريق ضغط الدمبل على مقعد مائل."
    },
    "dumbbell-incline-fly": {
      "name": "رفرفة مائلة بالدمبل",
      "description": "تمرين عزل للجزء العلوي من الصدر يتم على مقعد مائل، بفتح وإغلاق الذراعين في قوس واسع."
    },
    "dumbbell-overhead-lunge": {
      "name": "طعن علوي بالدمبل",
      "description": "طعن يتم أثناء حمل دمبل واحد أو اثنين فوق الرأس، مما يتحدى التوازن واستقرار الكتف وقوة الجذع."
    },
    "dumbbell-pistol-squat-double": {
      "name": "سكوات المسدس بالدمبل (مزدوج)",
      "description": "سكوات بساق واحدة يتم أثناء حمل دمبلين، عادة عند الكتفين أو الجانبين، مما يضيف حمولة كبيرة للحركة."
    },
    "dumbbell-pistol-squat-single": {
      "name": "سكوات المسدس بالدمبل (فردي)",
      "description": "سكوات بساق واحدة يتم أثناء حمل دمبل واحد، غالبًا في وضعية الكأس، ليكون بمثابة ثقل موازن وإضافة مقاومة."
    },
    "dumbbell-row-to-deadlift-complex": {
      "name": "مجموعة مركبة من التجديف إلى الرفعة الميتة بالدمبل",
      "description": "تسلسل يجمع بين رفعة ميتة رومانية بالدمبل وتجديف منحني في كل تكرار."
    },
    "dumbbell-tate-press": {
      "name": "ضغط تيت بالدمبل",
      "description": "تمرين للترايسبس يتم بالاستلقاء على مقعد، حيث يتم خفض الدمبل باتجاه الصدر مع توجيه المرفقين للخارج، ثم ضغطهما مرة أخرى لأعلى."
    },
    "explosive-clap-push-up": {
      "name": "ضغط متفجر مع تصفيق",
      "description": "تمرين ضغط بليومتري حيث تدفع بقوة من الأرض بقوة كافية لتصفيق يديك في الهواء."
    },
    "frog-stand": {
      "name": "وقفة الضفدع",
      "description": "توازن أساسي على الذراعين في الجمباز واليوغا، حيث توازن ركبتيك على مرفقيك في وضعية مطوية."
    },
    "front-lever": {
      "name": "الرافعة الأمامية",
      "description": "حركة جمباز متقدمة حيث يتم إبقاء الجسم موازيًا للأرض، والوجه لأعلى، أثناء التعلق بقضيب، مما يتطلب قوة هائلة في الظهر والجذع."
    },
    "glute-squeezes-isometric": {
      "name": "عصرات الأرداف (ثابتة)",
      "description": "تمرين تنشيط بسيط يتضمن عصر عضلات الأرداف وإبقائها مشدودة بوعي، وغالبًا ما يتم كجزء من الإحماء."
    },
    "half-turkish-get-up": {
      "name": "نصف النهضة التركية",
      "description": "الجزء الأول من النهضة التركية الكاملة، حيث تنتقل من وضع الاستلقاء إلى وضع الجلوس مع الوزن فوق الرأس. ممتاز لاستقرار الجذع والكتف."
    },
    "handstand": {
      "name": "الوقوف على اليدين",
      "description": "فعل دعم الجسم في وضع عمودي مقلوب ومستقر عن طريق التوازن على اليدين."
    },
    "handstand-push-up": {
      "name": "ضغط الوقوف على اليدين",
      "description": "تمرين ضغط متقدم يتم من وضعية الوقوف على اليدين، يستهدف الكتفين والترايسبس."
    },
    "heel-slides": {
      "name": "انزلاقات الكعب",
      "description": "تمرين إعادة تأهيل لطيف لثني الركبة، يتم عن طريق انزلاق الكعب باتجاه الجسم وبعيدًا عنه أثناء الجلوس أو الاستلقاء."
    },
    "hip-flexor-stretch": {
      "name": "إطالة عضلات الفخذ القابضة",
      "description": "إطالة تستهدف العضلات الموجودة في مقدمة الورك، وتتم عادةً في وضعية نصف ركوع."
    },
    "incline-chest-press-machine": {
      "name": "ضغط الصدر المائل (على الجهاز)",
      "description": "تمرين يعتمد على الجهاز يستهدف عضلات الصدر العلوية بحركة ضغط موجهة لأعلى."
    },
    "indian-club-double-circles": {
      "name": "دوائر مزدوجة بالصولجان الهندي",
      "description": "تمرين للتنسيق والحركة باستخدام صولجانين هنديين، يتم تأرجحهما في أنماط دائرية لتحسين صحة الكتف ونطاق الحركة."
    },
    "indian-club-heart-shapes": {
      "name": "أشكال القلب بالصولجان الهندي",
      "description": "تمرين إيقاعي بالصولجان الهندي حيث يتم تأرجح الصولجانات في نمط يشبه القلب، مما يعزز حركة الكتف والتنسيق."
    },
    "inverted-row": {
      "name": "تجديف مقلوب",
      "description": "تمرين ظهر بوزن الجسم حيث تتعلق تحت قضيب وتسحب صدرك نحوه، وغالبًا ما يعتبر تمهيدًا لتمرين العقلة."
    },
    "jump-squat": {
      "name": "سكوات مع قفز",
      "description": "تمرين بليومتري يجمع بين السكوات والقفز العمودي لتطوير قوة الجزء السفلي من الجسم وقدرته على الانفجار."
    },
    "kettlebell-360-mace-style": {
      "name": "360 بالكيتل بيل (بأسلوب الصولجان)",
      "description": "تمرين دوراني يحاكي حركة 360 بالصولجان الفولاذي، حيث يتم تأرجح الكيتل بيل حول الرأس لبناء قوة الكتف والجذع."
    },
    "kettlebell-arm-bar": {
      "name": "قفل الذراع بالكيتل بيل",
      "description": "تمرين لاستقرار وحركة الكتف، حيث تستلقي على جانبك بينما توازن كيتل بيل فوق الرأس بذراع مستقيمة."
    },
    "kettlebell-bent-press": {
      "name": "ضغط منحني بالكيتل بيل",
      "description": "رفعة كلاسيكية للرجل القوي تتضمن ضغط كيتل بيل فوق الرأس أثناء الانحناء جانبيًا، والاستفادة من قوة الجذع والظهر."
    },
    "kettlebell-bicep-curl": {
      "name": "مرجحة البايسبس بالكيتل بيل",
      "description": "تمرين عزل للبايسبس يتم عن طريق مرجحة الكيتل بيل. يمكن إجراؤه بقبضة قياسية أو قبضة ساحقة."
    },
    "kettlebell-bottoms-up-carry": {
      "name": "حمل الكيتل بيل مقلوبًا",
      "description": "حمل محمل حيث يتم حمل الكيتل بيل مقلوبًا، مما يتحدى القبضة، والكفة المدورة، واستقرار الجذع."
    },
    "kettlebell-bottoms-up-clean": {
      "name": "خطف الكيتل بيل مقلوبًا",
      "description": "رفع الكيتل بيل إلى وضع الرف ولكن الانتهاء به متوازنًا مقلوبًا، مما يتطلب توترًا وتحكمًا لا يصدق."
    },
    "kettlebell-bottoms-up-press": {
      "name": "ضغط الكيتل بيل مقلوبًا",
      "description": "ضغط صارم يتم مع حمل الكيتل بيل مقلوبًا، وهو ممتاز لبناء استقرار الكتف وميكانيكا الضغط."
    },
    "kettlebell-cheat-row": {
      "name": "تجديف بالغش بالكيتل بيل",
      "description": "تجديف منحني ثقيل يستخدم حركة جسم طفيفة أو زخم لرفع وزن أثقل مما هو ممكن بالأداء الصارم."
    },
    "kettlebell-clean-and-jerk-single-arm": {
      "name": "خطف ونتر بالكيتل بيل (ذراع واحدة)",
      "description": "الرفعة الكلاسيكية بالكيتل بيل، وتتضمن رفع الجرس إلى وضع الرف ثم دفعه فوق الرأس بنترة قوية."
    },
    "kettlebell-clean-ohp-complex": {
      "name": "مجموعة مركبة من الخطف والضغط العلوي بالكيتل بيل",
      "description": "مجموعة مركبة تجمع بين خطف كيتل بيل بذراع واحدة مباشرة في ضغط علوي لكل تكرار."
    },
    "kettlebell-close-grip-floor-press": {
      "name": "ضغط أرضي بقبضة ضيقة بالكيتل بيل",
      "description": "شكل من أشكال الضغط الأرضي يتم عن طريق حمل كيتل بيل واحد بكلتا اليدين في قبضة ضيقة، يستهدف الترايسبس والصدر الداخلي."
    },
    "kettlebell-cossack-squat": {
      "name": "سكوات القوزاق بالكيتل بيل",
      "description": "سكوات جانبي يبني حركة الورك وقوة الساق الواحدة، ويتم عن طريق النزول بالسكوات إلى جانب واحد أثناء حمل كيتل بيل، غالبًا في وضعية الكأس."
    },
    "kettlebell-crush-grip-curl": {
      "name": "مرجحة بقبضة ساحقة بالكيتل بيل",
      "description": "مرجحة بايسبس حيث يتم حمل الكيتل بيل من الجرس ('سحقه' بين اليدين) لزيادة التوتر الثابت في الصدر والذراعين."
    },
    "kettlebell-crush-grip-floor-press": {
      "name": "ضغط أرضي بقبضة ساحقة بالكيتل بيل",
      "description": "ضغط أرضي يتم عن طريق حمل كيتل بيل من الجرس بكلتا اليدين، مع التركيز على الصدر والترايسبس."
    },
    "kettlebell-curtsy-lunge": {
      "name": "طعن انحناءة بالكيتل بيل",
      "description": "شكل من أشكال الطعن حيث تتقاطع الساق الخلفية خلف الساق الأمامية، مستهدفة العضلة الألوية الوسطى والفخذين الداخليين، وغالبًا ما يتم أداؤها مع حمل كيتل بيل."
    },
    "kettlebell-dead-bug-pullover": {
      "name": "سحب بلوفر الحشرة الميتة بالكيتل بيل",
      "description": "تمرين للجذع يجمع بين حركة الحشرة الميتة وسحب البلوفر بالكيتل بيل، مما يتحدى التنسيق والاستقرار."
    },
    "kettlebell-dead-clean": {
      "name": "خطف ميت بالكيتل بيل",
      "description": "خطف كيتل بيل يبدأ من توقف تام على الأرض لكل تكرار، لبناء قوة متفجرة من الألف إلى الياء."
    },
    "kettlebell-dead-swing": {
      "name": "أرجحة ميتة بالكيتل بيل",
      "description": "أرجحة كيتل بيل حيث يبدأ كل تكرار من توقف تام على الأرض، مع التركيز على توليد أقصى قوة لكل أرجحة."
    },
    "kettlebell-deadstop-swing": {
      "name": "أرجحة بتوقف تام بالكيتل بيل",
      "description": "يُعرف أيضًا باسم الأرجحة الميتة، يبدأ هذا الشكل كل تكرار من الأرض لبناء دفع ورك متفجر دون الاستفادة من الزخم."
    },
    "kettlebell-deck-front-roll": {
      "name": "لفة أمامية من على السطح بالكيتل بيل",
      "description": "حركة ديناميكية تجمع بين لفة خلفية في سكوات السطح، باستخدام الكيتل بيل كثقل موازن للوقوف والانتقال إلى لفة أمامية."
    },
    "kettlebell-deck-squat": {
      "name": "سكوات السطح بالكيتل بيل",
      "description": "تمرين تقوم فيه بأداء سكوات، ثم تتدحرج على ظهرك، ثم تستخدم الزخم ووزن الكيتل بيل للتدحرج مرة أخرى إلى وضع الوقوف."
    },
    "kettlebell-double-farmers-walk": {
      "name": "مشي المزارع المزدوج بالكيتل بيل",
      "description": "تمرين لكامل الجسم حيث تمشي لمسافة أثناء حمل كيتل بيل ثقيل في كل يد."
    },
    "kettlebell-double-hand-deadlift": {
      "name": "رفعة ميتة بكلتا اليدين بالكيتل بيل",
      "description": "رفعة ميتة باستخدام كيتل بيل واحد يتم حمله بكلتا اليدين، ممتازة لتعلم نمط مفصلة الورك."
    },
    "kettlebell-double-hand-swing": {
      "name": "أرجحة بكلتا اليدين بالكيتل بيل",
      "description": "الأرجحة الأساسية بالكيتل بيل، وتتم عن طريق حمل كيتل بيل واحد بكلتا اليدين."
    },
    "kettlebell-double-overhead-squat": {
      "name": "سكوات علوي مزدوج بالكيتل بيل",
      "description": "شكل متقدم من أشكال السكوات يتطلب حركة واستقرارًا كبيرين، ويتم أثناء حمل اثنين من الكيتل بيل مقفلين فوق الرأس."
    },
    "kettlebell-double-shrug": {
      "name": "هز كتف مزدوج بالكيتل بيل",
      "description": "تمرين لتقوية عضلة الترابيس يتم عن طريق هز الكتفين أثناء حمل كيتل بيل ثقيل في كل يد."
    },
    "kettlebell-figure-eight-to-hold": {
      "name": "رقم ثمانية إلى ثبات بالكيتل بيل",
      "description": "شكل من أشكال تمرين رقم ثمانية بالكيتل بيل حيث يتم إيقاف الحركة مؤقتًا والإمساك بها في المقدمة، مما يتحدى الجذع والقبضة بشكل ثابت."
    },
    "kettlebell-floor-skullcrusher": {
      "name": "سحق الجمجمة على الأرض بالكيتل بيل",
      "description": "تمرين مد الترايسبس يتم بالاستلقاء على الأرض، وخفض كيتل بيل واحد أو اثنين باتجاه الرأس."
    },
    "kettlebell-get-up-sit-up": {
      "name": "نهضة جلوس بالكيتل بيل",
      "description": "مرحلة النهوض الأولية من النهضة التركية، ممتازة لبناء قوة واستقرار الجذع مع الوزن فوق الرأس."
    },
    "kettlebell-glute-bridge-with-floor-press": {
      "name": "جسر الأرداف مع ضغط أرضي بالكيتل بيل",
      "description": "تمرين مركب حيث تحافظ على وضعية جسر الأرداف أثناء أداء ضغط أرضي تبادلي أو مزدوج بالكيتل بيل."
    },
    "kettlebell-goblet-alternating-reverse-lunge": {
      "name": "طعن عكسي تبادلي بوضعية الكأس بالكيتل بيل",
      "description": "طعن عكسي يتم أثناء حمل كيتل بيل في وضعية الكأس، مع تبديل الساقين في كل تكرار."
    },
    "kettlebell-goblet-clean": {
      "name": "خطف بوضعية الكأس بالكيتل بيل",
      "description": "شكل من أشكال الخطف حيث يتم رفع الكيتل بيل إلى وضعية سكوات الكأس، محمولاً بكلتا اليدين على مستوى الصدر."
    },
    "kettlebell-goblet-squat-with-curl": {
      "name": "سكوات الكأس مع مرجحة بالكيتل بيل",
      "description": "مجموعة مركبة حيث يتم دمج سكوات الكأس مع مرجحة بايسبس في أعلى الحركة."
    },
    "kettlebell-goblet-walk": {
      "name": "مشي الكأس بالكيتل بيل",
      "description": "حمل محمل حيث تمشي أثناء حمل كيتل بيل في وضعية الكأس، مما يبني استقرار الجذع وقدرة تحمل الجزء العلوي من الجسم."
    },
    "kettlebell-good-morning-squat": {
      "name": "سكوات صباح الخير بالكيتل بيل",
      "description": "تمرين هجين يبدأ بصباح الخير (مفصلة الورك) ثم ينتقل إلى سكوات عميق، غالبًا مع حمل الكيتل بيل في وضعية الكأس."
    },
    "kettlebell-gorilla-clean": {
      "name": "خطف الغوريلا بالكيتل بيل",
      "description": "خطف متفجر يتم من وضعية سكوات/مفصلة عميقة، وغالبًا ما يتم باثنين من الكيتل بيل وبشكل تبادلي."
    },
    "kettlebell-half-kneeling-halo": {
      "name": "هالة نصف ركوع بالكيتل بيل",
      "description": "هالة كيتل بيل تتم من وضعية نصف ركوع لزيادة تحدي استقرار الجذع وعزل حزام الكتف."
    },
    "kettlebell-half-kneeling-press": {
      "name": "ضغط نصف ركوع بالكيتل بيل",
      "description": "ضغط علوي يتم من وضعية نصف ركوع لتحدي استقرار الجذع ومنع استخدام قوة دفع الساق."
    },
    "kettlebell-halifax": {
      "name": "هاليفاكس بالكيتل بيل",
      "description": "تدفق مركب بالكيتل بيل يجمع عادةً بين الخطف، والسكوات، والضغط الدوراني."
    },
    "kettlebell-hang-clean": {
      "name": "خطف معلق بالكيتل بيل",
      "description": "خطف كيتل بيل يبدأ من وضعية 'معلقة' (بعد الأرجحة الأولى) بدلاً من توقف تام على الأرض."
    },
    "kettlebell-jefferson-curl": {
      "name": "مرجحة جيفرسون بالكيتل بيل",
      "description": "إطالة انثناء العمود الفقري محملة باستخدام كيتل بيل لتحسين مرونة السلسلة الخلفية وحركة العمود الفقري."
    },
    "kettlebell-lateral-lunge": {
      "name": "طعن جانبي بالكيتل بيل",
      "description": "طعن إلى الجانب أثناء حمل كيتل بيل (غالبًا في وضعية الكأس أو الرف) لاستهداف الفخذين الداخليين والخارجيين وتحسين حركة الورك."
    },
    "kettlebell-lunge-pass-through": {
      "name": "تمرير الطعن بالكيتل بيل",
      "description": "شكل من أشكال الطعن يتضمن تمرير الكيتل بيل تحت الساق الأمامية، مما يتحدى التنسيق واستقرار الجذع."
    },
    "kettlebell-lying-triceps-extension": {
      "name": "مد الترايسبس مستلقياً بالكيتل بيل",
      "description": "تمرين عزل للترايسبس يتم بالاستلقاء على مقعد أو على الأرض ومد كيتل بيل واحد أو اثنين من خلف الرأس."
    },
    "kettlebell-outside-swing": {
      "name": "أرجحة خارجية بالكيتل بيل",
      "description": "شكل من أشكال الأرجحة حيث ينتقل الكيتل بيل خارج الساق بدلاً من بين الساقين."
    },
    "kettlebell-pistol-squat-double": {
      "name": "سكوات المسدس بالكيتل بيل (مزدوج)",
      "description": "سكوات متقدم بساق واحدة يتم أثناء حمل اثنين من الكيتل بيل في وضع الرف الأمامي."
    },
    "kettlebell-pistol-squat-single": {
      "name": "سكوات المسدس بالكيتل بيل (فردي)",
      "description": "سكوات بساق واحدة يتم أثناء حمل كيتل بيل واحد في وضعية الكأس ليكون بمثابة ثقل موازن."
    },
    "kettlebell-plank-drag-pull-through": {
      "name": "سحب بلانك بالكيتل بيل (سحب عبر)",
      "description": "تمرين للجذع مضاد للدوران حيث تحافظ على وضعية بلانك وتسحب كيتل بيل من جانب من جسمك إلى الآخر."
    },
    "kettlebell-pullover-to-sit-up-to-press": {
      "name": "سحب بلوفر إلى نهضة جلوس إلى ضغط بالكيتل بيل",
      "description": "حركة مركبة تجمع بين سحب البلوفر، ونهضة جلوس، وضغط علوي في تسلسل واحد سلس."
    },
    "kettlebell-rack-carry": {
      "name": "حمل الرف بالكيتل بيل",
      "description": "حمل محمل حيث تمشي أثناء حمل كيتل بيل واحد أو اثنين في وضع الرف الأمامي، مما يبني قوة الجذع وأعلى الظهر."
    },
    "kettlebell-rack-walk": {
      "name": "مشي الرف بالكيتل بيل",
      "description": "اسم آخر لحمل الرف بالكيتل بيل، مع التركيز على المشي لمسافة أو لوقت."
    },
    "kettlebell-rotational-deadlift": {
      "name": "رفعة ميتة دورانية بالكيتل بيل",
      "description": "شكل من أشكال الرفعة الميتة يتضمن دوران الجذع لالتقاط كيتل بيل موضوع على جانب الجسم."
    },
    "kettlebell-rotational-swing": {
      "name": "أرجحة دورانية بالكيتل بيل",
      "description": "أرجحة كيتل بيل مع مكون دوراني، حيث يدور الوركان والجذع أثناء الحركة."
    },
    "kettlebell-row-to-deadlift-complex": {
      "name": "مجموعة مركبة من التجديف إلى الرفعة الميتة بالكيتل بيل",
      "description": "تسلسل يتضمن رفعة ميتة بالكيتل بيل يليه مباشرة تجديف منحني."
    },
    "kettlebell-side-press": {
      "name": "ضغط جانبي بالكيتل بيل",
      "description": "شكل كلاسيكي من أشكال الضغط حيث تميل بعيدًا عن الكيتل بيل للحصول على ميزة ميكانيكية لضغطه فوق الرأس."
    },
    "kettlebell-single-arm-clean-and-thruster": {
      "name": "خطف وثراستر بذراع واحدة بالكيتل بيل",
      "description": "مجموعة مركبة تجمع بين خطف بذراع واحدة، وسكوات، وضغط علوي في حركة قوية وسلسة واحدة."
    },
    "kettlebell-single-arm-complex-clean-squat-press": {
      "name": "مجموعة مركبة بذراع واحدة بالكيتل بيل (خطف-سكوات-ضغط)",
      "description": "تسلسل من خطف بذراع واحدة، وسكوات، وضغط علوي يتم دون إنزال الكيتل بيل."
    },
    "kettlebell-single-arm-deadlift": {
      "name": "رفعة ميتة بذراع واحدة بالكيتل بيل",
      "description": "رفعة ميتة تتم برفع كيتل بيل واحد بذراع واحدة، مما يتحدى مقاومة الدوران وقوة القبضة."
    },
    "kettlebell-single-arm-overhead-squat": {
      "name": "سكوات علوي بذراع واحدة بالكيتل بيل",
      "description": "سكوات يتم أثناء حمل كيتل بيل واحد مقفل فوق الرأس، ويتطلب حركة واستقرارًا استثنائيين."
    },
    "kettlebell-single-arm-shrug": {
      "name": "هز كتف بذراع واحدة بالكيتل بيل",
      "description": "هز كتف أحادي الجانب يتم بكيتل بيل ثقيل لاستهداف عضلة الترابيس على جانب واحد."
    },
    "kettlebell-single-arm-thruster": {
      "name": "ثراستر بذراع واحدة بالكيتل بيل",
      "description": "تمرين مركب يجمع بين سكوات بذراع واحدة في وضع الرف وضغط علوي."
    },
    "kettlebell-single-leg-deadlift": {
      "name": "رفعة ميتة بساق واحدة بالكيتل بيل",
      "description": "حركة مفصلة أحادية الجانب تتحدى التوازن والاستقرار وقوة السلسلة الخلفية، وتتم أثناء حمل كيتل بيل."
    },
    "kettlebell-slingshot": {
      "name": "المقلاع بالكيتل بيل",
      "description": "تمرين إحماء وتنسيق يتضمن تمرير كيتل بيل حول الجسم من يد إلى أخرى."
    },
    "kettlebell-slingshot-to-goblet-squat": {
      "name": "مقلاع إلى سكوات الكأس بالكيتل بيل",
      "description": "تدفق يجمع بين مقلاع الكيتل بيل وسكوات الكأس في كل تكرار."
    },
    "kettlebell-snatch-to-overhead-reverse-lunge": {
      "name": "خطف إلى طعن عكسي علوي بالكيتل بيل",
      "description": "مجموعة مركبة تقوم فيها بأداء خطف كيتل بيل ثم تنفيذ طعن عكسي مع الحفاظ على استقرار الكيتل بيل فوق الرأس."
    },
    "kettlebell-snatch-to-reverse-lunge": {
      "name": "خطف إلى طعن عكسي بالكيتل بيل",
      "description": "مجموعة مركبة تجمع بين خطف كيتل بيل وطعن عكسي. يمكن أداء الطعن مع الجرس في وضع الرف أو فوق الرأس."
    },
    "kettlebell-somersault-squat": {
      "name": "سكوات الشقلبة بالكيتل بيل",
      "description": "شكل متقدم من أشكال السكوات يتضمن دحرجة الكيتل بيل فوق الكتف أثناء السكوات، مما يتحدى الحركة والتنسيق."
    },
    "kettlebell-sots-press": {
      "name": "ضغط سوتس بالكيتل بيل",
      "description": "ضغط علوي يتم من أسفل سكوات عميق، ويتطلب حركة واستقرارًا وقوة لا تصدق."
    },
    "kettlebell-sport-style-swing": {
      "name": "أرجحة بأسلوب رياضة الكيتل بيل",
      "description": "أرجحة أكثر كفاءة تشبه البندول تستخدم في مسابقات رياضة الكيتل بيل (جيريفوي)، مصممة للتحمل على حساب القوة القصوى."
    },
    "kettlebell-stacked-stance-deadlift": {
      "name": "رفعة ميتة بوقفة متراصة بالكيتل بيل",
      "description": "شكل من أشكال الرفعة الميتة بوقفة متدرجة (قدم واحدة خلف الأخرى قليلاً) لزيادة الحمل على الساق الأمامية."
    },
    "kettlebell-standing-pullover": {
      "name": "سحب بلوفر واقفًا بالكيتل بيل",
      "description": "تمرين حركة وقوة لعضلات الظهر العريضة والمنشارية، يتم عن طريق خفض كيتل بيل خلف الرأس أثناء الوقوف."
    },
    "kettlebell-straight-leg-sit-up": {
      "name": "نهضة جلوس بساق مستقيمة بالكيتل بيل",
      "description": "نهضة جلوس محملة بالوزن تتم بساقين مستقيمتين أثناء حمل كيتل بيل عند الصدر أو فوق الرأس."
    },
    "kettlebell-suitcase-farmers-carry": {
      "name": "حمل الحقيبة/المزارع بالكيتل بيل",
      "description": "حمل محمل يتم بكيتل بيل في يد واحدة (حقيبة) أو كلتا اليدين (مزارع)، لبناء قوة القبضة والجذع والقامة."
    },
    "kettlebell-sumo-deadlift-high-pull": {
      "name": "رفعة ميتة سومو مع سحب عالي بالكيتل بيل",
      "description": "حركة متفجرة تجمع بين رفعة ميتة سومو وتجديف عمودي قوي، لتطوير قوة الجسم بالكامل."
    },
    "kettlebell-swing-to-snatch": {
      "name": "أرجحة إلى خطف بالكيتل بيل",
      "description": "تمرين يساعد على تعلم الخطف عن طريق تقسيمه إلى أرجحة تليها لكمة لأعلى للقفل."
    },
    "kettlebell-tactical-lunge": {
      "name": "طعن تكتيكي بالكيتل بيل",
      "description": "شكل من أشكال الطعن يتضمن غالبًا تمريرًا أو حركة منسقة أخرى، مع التركيز على الرياضية والتحكم."
    },
    "kettlebell-tall-kneeling-press": {
      "name": "ضغط ركوع طويل بالكيتل بيل",
      "description": "ضغط علوي يتم أثناء الركوع على كلتا الركبتين، مما يشغل الأرداف والجذع لإنشاء قاعدة مستقرة."
    },
    "kettlebell-tate-press": {
      "name": "ضغط تيت بالكيتل بيل",
      "description": "ضغط للترايسبس حيث يتم خفض الكيتل بيل باتجاه الصدر مع توجيه المرفقين للخارج، على غرار النسخة بالدمبل."
    },
    "kettlebell-towel-curl": {
      "name": "مرجحة بالمنشفة بالكيتل بيل",
      "description": "مرجحة بايسبس باستخدام منشفة يتم تمريرها عبر مقبض الكيتل بيل لتحدي قوة القبضة."
    },
    "kettlebell-turkish-sit-up": {
      "name": "نهضة جلوس تركية بالكيتل بيل",
      "description": "جزء النهوض من النهضة التركية، وهو تمرين قوي للجذع وعضلات الفخذ القابضة."
    },
    "kettlebell-two-hand-bottoms-up-squat": {
      "name": "سكوات بكلتا اليدين بالكيتل بيل مقلوبًا",
      "description": "سكوات يتم أثناء موازنة كيتل بيل مقلوبًا بكلتا اليدين، ويتطلب توترًا هائلاً لكامل الجسم."
    },
    "kettlebell-upright-row": {
      "name": "تجديف عمودي بالكيتل بيل",
      "description": "تمرين يستهدف الكتفين والترابيس عن طريق سحب كيتل بيل واحد أو اثنين لأعلى باتجاه الذقن."
    },
    "kettlebell-waiters-walk": {
      "name": "مشي النادل بالكيتل بيل",
      "description": "حمل أحادي الجانب محمل بحمل كيتل بيل مستقيمًا فوق الرأس، كما لو كنت تحمل صينية. يبني استقرار الكتف والجذع."
    },
    "l-sit": {
      "name": "جلسة L",
      "description": "تمرين جمبازي حيث يتم إبقاء الجسم على شكل الحرف 'L'، مع دعم النفس باليدين بينما تكون الساقان ممدودتين بشكل مستقيم. يتطلب قوة كبيرة في الجذع والترايسبس."
    },
    "leg-raises": {
      "name": "رفع الأرجل",
      "description": "تمرين للجذع يستهدف عضلات البطن السفلية، ويتم بالاستلقاء على الظهر ورفع الساقين باتجاه السقف."
    },
    "lower-trunk-rotations-supine": {
      "name": "دورانات الجذع السفلي (مستلقياً)",
      "description": "تمرين حركة لطيف لأسفل الظهر، يتم بالاستلقاء على الظهر مع ثني الركبتين وتدوير الساقين من جانب إلى آخر."
    },
    "lying-leg-curl-machine": {
      "name": "ثني الأرجل مستلقياً (على الجهاز)",
      "description": "تمرين عزل لأوتار الركبة يتم على جهاز أثناء الاستلقاء على البطن."
    },
    "macebell-10-to-2": {
      "name": "10 إلى 2 بالصولجان",
      "description": "تمرين أساسي بالصولجان يتضمن تأرجحًا بندوليًا من جانب إلى آخر أمام الجسم، على غرار حركة عقارب الساعة من 10 إلى 2."
    },
    "macebell-360": {
      "name": "360 بالصولجان",
      "description": "التمرين المميز بالصولجان، ويتضمن تأرجح الصولجان في دائرة كاملة حول الرأس، لبناء قوة القبضة والكتف والجذع."
    },
    "macebell-gravedigger": {
      "name": "حفار القبور بالصولجان",
      "description": "تمرين دوراني يحاكي حركة الحفر بالمجرفة، ويستهدف الجذع ويحسن القوة الدورانية."
    },
    "macebell-spear-stab": {
      "name": "طعنة الرمح بالصولجان",
      "description": "تمرين لكامل الجسم يحاكي الطعن بالرمح، ويتضمن دفعة قوية للأمام بالصولجان."
    },
    "machine-chest-press": {
      "name": "ضغط الصدر على الجهاز",
      "description": "تمرين مركب للصدر، يشبه ضغط البنش ولكن بمسار حركة ثابت يوفره الجهاز."
    },
    "machine-hip-abduction": {
      "name": "تبعيد الورك على الجهاز",
      "description": "تمرين عزل يعتمد على الجهاز للفخذين الخارجيين والعضلة الألوية الوسطى عن طريق دفع الساقين بعيدًا ضد المقاومة."
    },
    "machine-hip-adduction": {
      "name": "تقريب الورك على الجهاز",
      "description": "تمرين عزل يعتمد على الجهاز للفخذين الداخليين عن طريق ضغط الساقين معًا ضد المقاومة."
    },
    "machine-lateral-raise": {
      "name": "رفرفة جانبية على الجهاز",
      "description": "تمرين عزل للعضلة الدالية الوسطى باستخدام جهاز يوفر مسارًا ثابتًا لحركة الرفرفة الجانبية."
    },
    "military-press-barbell": {
      "name": "ضغط عسكري (بالبار)",
      "description": "ضغط علوي صارم بالبار، يتم أثناء الوقوف، بدون دفع من الساق. وهو اختبار أساسي لقوة الكتف."
    },
    "muscle-up": {
      "name": "الصعود العضلي",
      "description": "مهارة جمباز متقدمة تجمع بين تمرين العقلة والغطس في حركة واحدة سلسة للانتقال من التعلق أسفل قضيب أو حلقات إلى الدعم فوقها."
    },
    "parallette-deep-push-up": {
      "name": "ضغط عميق على المتوازي",
      "description": "تمرين ضغط يتم على متوازيات صغيرة، مما يسمح بزيادة نطاق الحركة وإطالة أعمق في الصدر."
    },
    "parallette-l-sit": {
      "name": "جلسة L على المتوازي",
      "description": "جلسة L تتم على متوازيات صغيرة، والتي يمكن أن تكون أسهل قليلاً من على الأرض لأنها توفر مساحة أكبر للساقين."
    },
    "parallette-shoot-through": {
      "name": "الاختراق على المتوازي",
      "description": "حركة جمباز ديناميكية على متوازيات صغيرة، تنتقل من وضعية بلانك أو ضغط إلى وضعية مطوية أو جلسة L عن طريق 'إطلاق' الساقين عبر الذراعين."
    },
    "parallette-tuck-planche": {
      "name": "بلانش مطوي على المتوازي",
      "description": "تقدم نحو البلانش الكامل، يتم على متوازيات صغيرة، حيث يتم دعم الجسم بالذراعين مع ثني الركبتين في الصدر."
    },
    "pelvic-tilts": {
      "name": "إمالة الحوض",
      "description": "تمرين لتنشيط الجذع وحركة العمود الفقري يتضمن إمالة الحوض للأمام والخلف، وغالبًا ما يتم أداؤه مستلقياً على الظهر."
    },
    "pike-push-up": {
      "name": "ضغط الرمح",
      "description": "شكل من أشكال تمرين الضغط يتم مع رفع الوركين عاليًا في شكل 'V' مقلوب، مما يحول التركيز إلى الكتفين. تقدم نحو ضغط الوقوف على اليدين."
    },
    "piriformis-stretch-supine": {
      "name": "إطالة العضلة الكمثرية (مستلقياً)",
      "description": "إطالة للعضلة الكمثرية في الورك، تتم بالاستلقاء على الظهر، غالبًا عن طريق وضع كاحل فوق الركبة المقابلة والسحب باتجاه الصدر."
    },
    "pistol-squat": {
      "name": "سكوات المسدس",
      "description": "تمرين متقدم بوزن الجسم يتكون من سكوات بساق واحدة، ويتطلب قوة وتوازنًا وحركة كبيرة."
    },
    "planche": {
      "name": "بلانش",
      "description": "مهارة جمباز متقدمة حيث يتم إبقاء الجسم موازيًا للأرض، مدعومًا باليدين فقط، مما يتطلب قوة وتوازنًا لا يصدق في الذراع المستقيمة."
    },
    "plank-to-push-up": {
      "name": "من بلانك إلى ضغط",
      "description": "تمرين ديناميكي حيث تتبادل بين بلانك الساعد وبلانك عالي (وضعية الضغط)، مما يتحدى استقرار الجذع وقوة الجزء العلوي من الجسم."
    },
    "proprioceptive-close-grip-push-up": {
      "name": "ضغط بقبضة ضيقة لتحسين استقبال الحس العميق",
      "description": "ضغط بقبضة ضيقة يتم على سطح غير مستقر لتحدي الاستقرار والتحكم والوعي بالجسم."
    },
    "proprioceptive-pause-goblet-squat": {
      "name": "سكوات الكأس مع توقف لتحسين استقبال الحس العميق",
      "description": "سكوات الكأس مع توقف في الأسفل، غالبًا ما يتم مع إغماض العينين أو على سطح غير مستقر لتعزيز استقبال الحس العميق والاستقرار."
    },
    "quad-sets-isometric": {
      "name": "مجموعات الفخذ (ثابتة)",
      "description": "تمرين تقوية ثابت لعضلات الفخذ الأمامية، يتضمن تقليص العضلة دون تحريك مفصل الركبة. غالبًا ما يستخدم في المرحلة المبكرة من إعادة التأهيل."
    },
    "ring-archer-pull-up": {
      "name": "عقلة الرامي على الحلقات",
      "description": "شكل من أشكال تمرين العقلة أحادي الجانب على حلقات الجمباز، حيث تسحب إحدى الذراعين بينما تمتد الأخرى إلى الجانب، على غرار رامي السهام الذي يسحب القوس."
    },
    "ring-dip": {
      "name": "غطس على الحلقات",
      "description": "غطس يتم على حلقات الجمباز، مما يضيف مكون عدم الاستقرار الذي يتطلب قوة واستقرارًا أكبر من الكتفين والصدر."
    },
    "ring-muscle-up": {
      "name": "الصعود العضلي على الحلقات",
      "description": "صعود عضلي يتم على حلقات الجمباز، مما يسمح بانتقال أكثر طبيعية بسبب حركة الحلقات."
    },
    "ring-row": {
      "name": "تجديف على الحلقات",
      "description": "تجديف مقلوب يتم باستخدام حلقات الجمباز، مما يسمح بالدوران الطبيعي لليدين وصعوبة قابلة للتعديل عن طريق تغيير زاوية الجسم."
    },
    "ring-skin-the-cat": {
      "name": "سلخ القط على الحلقات",
      "description": "تمرين حركة جمباز أساسي على الحلقات، يتضمن تمرير القدمين والوركين عبر الذراعين وفوق الرأس إلى وضع التعلق، ثم العودة."
    },
    "ring-support-hold": {
      "name": "ثبات الدعم على الحلقات",
      "description": "ثبات ثابت أساسي على حلقات الجمباز، حيث تدعم وزن جسمك بذراعين مستقيمتين، مما يتطلب استقرارًا كبيرًا."
    },
    "sandbag-bear-hug-squat": {
      "name": "سكوات عناق الدب بكيس الرمل",
      "description": "سكوات يتم أثناء معانقة كيس رمل عموديًا على الجذع، مما يشغل الجذع وأعلى الظهر بشكل مكثف."
    },
    "sandbag-clean": {
      "name": "خطف بكيس الرمل",
      "description": "تمرين متفجر حيث يتم رفع كيس رمل من الأرض إلى الكتف في حركة قوية واحدة."
    },
    "sandbag-over-the-shoulder-carry": {
      "name": "حمل كيس الرمل فوق الكتف",
      "description": "حمل محمل حيث يتم حمل كيس رمل ثقيل فوق كتف واحد، مما يتحدى الجذع والسلسلة الخلفية."
    },
    "sandbag-rotational-lunge": {
      "name": "طعن دوراني بكيس الرمل",
      "description": "طعن يتضمن دوران الجذع، مع حمل كيس رمل لإضافة مقاومة وتحدي الجذع."
    },
    "sandbag-shouldering": {
      "name": "تحميل كيس الرمل على الكتف",
      "description": "فعل رفع كيس رمل من الأرض ووضعه على كتف واحد، وهي مهارة أساسية في رفع الأجسام الغريبة والرجل القوي."
    },
    "sandbag-zercher-squat": {
      "name": "سكوات زرشر بكيس الرمل",
      "description": "سكوات يتم أثناء حمل كيس رمل في ثنية المرفقين، مما يفرض ضغطًا كبيرًا على الجذع وأعلى الظهر والذراعين."
    },
    "scapular-retraction-shoulder-blade-squeezes": {
      "name": "سحب لوح الكتف (عصرات لوح الكتف)",
      "description": "تمرين للقامة يركز على عصر لوحي الكتف معًا لتقوية العضلات المعينية والترابيس الوسطى."
    },
    "seated-hamstring-stretch": {
      "name": "إطالة أوتار الركبة جالسًا",
      "description": "إطالة لأوتار الركبة تتم من وضع الجلوس، عادةً عن طريق الوصول إلى أصابع القدمين بساقين مستقيمتين."
    },
    "seated-pec-deck-fly": {
      "name": "رفرفة الفراشة جالسًا على الجهاز",
      "description": "تمرين عزل للصدر باستخدام جهاز حيث تجلس وتجمع رافعات مبطنة معًا في حركة طيران."
    },
    "shoulder-external-rotation-banded": {
      "name": "دوران خارجي للكتف (بالشريط)",
      "description": "تمرين وقائي/إعادة تأهيل لعضلات الكفة المدورة، باستخدام شريط مقاومة لتدوير الذراع للخارج ضد التوتر."
    },
    "shoulder-pendulum-swings": {
      "name": "أرجحات البندول للكتف",
      "description": "تمرين لطيف لنطاق حركة مفصل الكتف، غالبًا ما يستخدم في المرحلة المبكرة من إعادة التأهيل، ويتضمن الانحناء والتأرجح اللطيف للذراع."
    },
    "shrimp-squat": {
      "name": "سكوات الجمبري",
      "description": "شكل من أشكال السكوات بساق واحدة حيث يتم ثني الساق غير العاملة وإبقائها خلف الجسم، على غرار سكوات المسدس ولكن بوضعية ساق مختلفة."
    },
    "side-plank": {
      "name": "بلانك جانبي",
      "description": "تمرين جذع ثابت يتم على جانب واحد لاستهداف العضلات المائلة وتحسين الاستقرار الجانبي."
    },
    "single-kettlebell-alternating-swing": {
      "name": "أرجحة تبادلية بكيتل بيل واحد",
      "description": "أرجحة كيتل بيل حيث يتم تمرير الجرس من يد إلى أخرى في ذروة كل أرجحة."
    },
    "single-kettlebell-clean-and-press-to-pause-windmill": {
      "name": "خطف وضغط إلى طاحونة مع توقف بكيتل بيل واحد",
      "description": "تدفق مركب يجمع بين الخطف، والضغط، ثم الطاحونة مع توقف، مما يتحدى القوة والاستقرار والحركة."
    },
    "single-kettlebell-clean-and-press": {
      "name": "خطف وضغط بكيتل بيل واحد",
      "description": "مزيج كلاسيكي حيث يتم رفع كيتل بيل إلى وضع الرف ثم ضغطه فورًا فوق الرأس."
    },
    "single-kettlebell-figure-eight": {
      "name": "رقم ثمانية بكيتل بيل واحد",
      "description": "تمرين ديناميكي يحسن التنسيق، واستقرار الجذع، وقوة القبضة عن طريق تمرير الكيتل بيل بين وحول الساقين في حركة تشبه الرقم ثمانية."
    },
    "single-kettlebell-front-squat": {
      "name": "سكوات أمامي بكيتل بيل واحد",
      "description": "سكوات يتم بكيتل بيل واحد محمول في وضع الرف الأمامي، مما يخلق حملاً غير متماثل يتحدى استقرار الجذع."
    },
    "single-kettlebell-high-pull": {
      "name": "سحب عالي بكيتل بيل واحد",
      "description": "تمرين متفجر يتضمن سحب كيتل بيل من وضع الأرجحة حتى ارتفاع الذقن، مع إبقاء الكوع مرتفعًا."
    },
    "single-kettlebell-jerk": {
      "name": "نتر بكيتل بيل واحد",
      "description": "رفعة قوية حيث تستخدم حركة 'غطس مزدوج' بساقيك لدفع كيتل بيل واحد فوق الرأس."
    },
    "single-kettlebell-overhead-lunge": {
      "name": "طعن علوي بكيتل بيل واحد",
      "description": "طعن يتم أثناء حمل كيتل بيل واحد مقفل فوق الرأس، مما يخلق تحديًا كبيرًا للاستقرار."
    },
    "single-kettlebell-overhead-press": {
      "name": "ضغط علوي بكيتل بيل واحد",
      "description": "تمرين قوة أساسي للجزء العلوي من الجسم يتضمن ضغط كيتل بيل واحد من وضع الرف إلى قفل علوي."
    },
    "single-kettlebell-russian-twist": {
      "name": "التواء روسي بكيتل بيل واحد",
      "description": "تمرين للجذع يستهدف العضلات المائلة، يتم بالجلوس ولف الجذع من جانب إلى آخر أثناء حمل كيتل بيل واحد."
    },
    "single-kettlebell-swing": {
      "name": "أرجحة بكيتل بيل واحد",
      "description": "أرجحة الكيتل بيل بيد واحدة، والتي تضيف تحديًا مضادًا للدوران إلى الأرجحة القياسية بكلتا اليدين."
    },
    "single-leg-stance-balance": {
      "name": "وقفة على ساق واحدة (توازن)",
      "description": "تمرين توازن أساسي يتضمن الوقوف على ساق واحدة لفترة زمنية محددة."
    },
    "skater-jumps": {
      "name": "قفزات المتزلج",
      "description": "تمرين بليومتري يتضمن قفزات جانبية من ساق إلى أخرى، محاكيًا حركة المتزلج السريع لبناء القوة والرشاقة."
    },
    "slow-eccentric-floor-skullcrusher": {
      "name": "سحق الجمجمة على الأرض ببطء غريب الأطوار",
      "description": "سحق جمجمة للترايسبس يتم على الأرض مع التركيز على مرحلة خفض بطيئة جدًا ومتحكم بها (غريبة الأطوار)."
    },
    "slow-eccentric-floor-skullcrusher-to-close-grip-floor-press": {
      "name": "سحق الجمجمة على الأرض ببطء غريب الأطوار إلى ضغط أرضي بقبضة ضيقة",
      "description": "مجموعة مركبة تركز على الترايسبس تجمع بين سحق جمجمة ببطء غريب الأطوار وضغط أرضي بقبضة ضيقة في كل تكرار."
    },
    "slow-eccentric-pause-towel-curls": {
      "name": "مرجحة بالمنشفة مع توقف وبطء غريب الأطوار",
      "description": "مرجحة بايسبس باستخدام منشفة للقبضة، مع التركيز على مرحلة خفض بطيئة وتوقف لزيادة الوقت تحت التوتر إلى أقصى حد."
    },
    "standing-calf-raise": {
      "name": "رفع السمانة واقفًا",
      "description": "تمرين لتقوية عضلة الساق الخلفية (التوأمية الساقية) عن طريق رفع الكعبين من وضع الوقوف."
    },
    "dip": {
      "name": "غطس على قضيب مستقيم",
      "description": "غطس يتم على قضيب مستقيم واحد، ويتطلب استقرارًا أكبر للجذع وزاوية كتف مختلفة عن غطس القضبان المتوازية."
    },
    "straight-leg-raise": {
      "name": "رفع الساق المستقيمة",
      "description": "تمرين للجذع وعضلات الفخذ القابضة يتم بالاستلقاء على الظهر ورفع ساق واحدة أو كلتيهما بشكل مستقيم دون ثني الركبتين."
    },
    "suitcase-deadlift-to-anti-rotation-row": {
      "name": "رفعة ميتة بوضعية الحقيبة إلى تجديف مضاد للدوران",
      "description": "مجموعة مركبة تجمع بين رفعة ميتة بوضعية الحقيبة بذراع واحدة وتجديف في الأعلى، مما يتحدى الجذع لمقاومة الدوران."
    },
    "superman-extensions": {
      "name": "تمديدات سوبرمان",
      "description": "تمرين بوزن الجسم يقوي أسفل الظهر والأرداف وأوتار الركبة عن طريق رفع الذراعين والساقين في وقت واحد عن الأرض أثناء الاستلقاء على البطن."
    },
    "terminal-knee-extension-tke": {
      "name": "تمديد الركبة النهائي (TKE)",
      "description": "تمرين إعادة تأهيل وتنشيط لعضلات الفخذ الأمامية (تحديدًا العضلة المتسعة الإنسية) يركز على الدرجات القليلة الأخيرة من تمديد الركبة، وغالبًا ما يستخدم شريط مقاومة."
    },
    "towel-scrunches": {
      "name": "تجعيد المنشفة",
      "description": "تمرين للعضلات الداخلية للقدمين، يتم عن طريق استخدام أصابع القدم لتجعيد منشفة موضوعة على الأرض."
    },
    "tuck-planche": {
      "name": "بلانش مطوي",
      "description": "تقدم أساسي للبلانش الكامل، حيث يتم موازنة الجسم على اليدين مع ثني الركبتين بإحكام في الصدر."
    },
    "twist-sit-up": {
      "name": "نهضة جلوس مع التواء",
      "description": "شكل من أشكال النهوض يتضمن التواء الجذع في أعلى الحركة لإشراك العضلات المائلة."
    },
    "upper-trapezius-stretch": {
      "name": "إطالة الترابيس العلوية",
      "description": "إطالة للرقبة تتم عن طريق إمالة الرأس بلطف إلى جانب واحد لإطالة عضلة الترابيس العلوية."
    },
    "vipr-cylinder-drop-squat": {
      "name": "سكوات إسقاط الأسطوانة ViPR",
      "description": "سكوات ديناميكي باستخدام ViPR، حيث يتم إسقاط الأسطوانة والتقاطها، مما يدمج الحركة والحمل."
    },
    "vipr-cylinder-lift": {
      "name": "رفع الأسطوانة ViPR",
      "description": "تمرين أساسي بـ ViPR يتضمن رفع الأسطوانة في مستويات حركة مختلفة، غالبًا ما يحاكي المهام الوظيفية."
    },
    "vipr-ice-skater": {
      "name": "المتزلج على الجليد ViPR",
      "description": "تمرين حركة جانبي باستخدام ViPR يحاكي حركة التزلج على الجليد، ويبني القوة والرشاقة في المستوى الأمامي."
    },
    "vipr-lateral-shift-with-rip": {
      "name": "تحول جانبي مع تمزيق ViPR",
      "description": "تمرين ديناميكي يجمع بين تحول جانبي لـ ViPR وحركة 'تمزيق' قوية بالدفع والسحب."
    },
    "vipr-shoveling": {
      "name": "التجريف ViPR",
      "description": "تمرين دوراني لكامل الجسم يحاكي حركة التجريف، ويطور القوة والتنسيق من خلال الوركين والجذع."
    },
    "vipr-thread-the-needle": {
      "name": "تمرير الخيط في الإبرة ViPR",
      "description": "تمرين حركة واستقرار باستخدام ViPR، يتضمن وصولًا دورانيًا تحت الجسم لتحسين حركة العمود الفقري الصدري."
    },
    "wall-handstand": {
      "name": "الوقوف على اليدين على الحائط",
      "description": "وقوف على اليدين يتم مع إسناد القدمين على الحائط للدعم، ويستخدم لبناء القوة والثقة للوقوف على اليدين بشكل حر."
    },
    "rehab-wall-push-up": {
      "name": "ضغط على الحائط",
      "description": "شكل مبتدئ من تمرين الضغط حيث تدفع ضد الحائط، مما يقلل من كمية وزن الجسم المرفوع."
    },
    "wall-sit": {
      "name": "جلوس الحائط",
      "description": "تمرين ثابت حيث تحافظ على وضعية سكوات وظهرك مقابل الحائط، ويقوي بشكل أساسي عضلات الفخذ الأمامية."
    },
    "rehab-wall-sit-isometric": {
      "name": "جلوس الحائط (ثابت)",
      "description": "تمرين ثابت يحافظ على وضعية سكوات مقابل الحائط لبناء التحمل العضلي في عضلات الفخذ الأمامية والأرداف وأوتار الركبة."
    }
}