{
  "exercises": {
    "push-up": {
      "name": "Отжимание",
      "description": "Классическое упражнение с собственным весом, которое прорабатывает грудь, плечи и трицепсы. Держите тело прямым, а корпус напряженным."
    },
    "pull-up": {
      "name": "Подтягивание",
      "description": "Продвинутое упражнение с собственным весом, нацеленное на спину и бицепсы, выполняемое хватом сверху."
    },
    "chin-up": {
      "name": "Подтягивание обратным хватом",
      "description": "Упражнение с собственным весом, нацеленное на спину и бицепсы, выполняемое хватом снизу, часто с большим акцентом на бицепсы, чем при обычных подтягиваниях."
    },
    "bodyweight-squat": {
      "name": "Приседание с собственным весом",
      "description": "Фундаментальное упражнение для нижней части тела, задействующее квадрицепсы, ягодицы и бицепсы бедра без дополнительного веса."
    },
    "lunge": {
      "name": "Выпад",
      "description": "Одностороннее упражнение для ног, которое улучшает баланс, стабильность и укрепляет квадрицепсы, ягодицы и бицепсы бедра."
    },
    "plank": {
      "name": "Планка",
      "description": "Изометрическое упражнение для укрепления кора, заключающееся в удержании положения, похожего на отжимание, максимально возможное время."
    },
    "burpee": {
      "name": "Бёрпи",
      "description": "Высокоинтенсивное упражнение для всего тела, сочетающее в себе приседание, отжимание и прыжок."
    },
    "dip-bar": {
      "name": "Отжимания на брусьях",
      "description": "Базовое упражнение с собственным весом, в основном нацеленное на трицепсы и грудь, выполняемое на параллельных брусьях."
    },
    "barbell-squat": {
      "name": "Приседание со штангой",
      "description": "Основное силовое упражнение, нацеленное на квадрицепсы, ягодицы, бицепсы бедра и низ спины, выполняемое путем приседания со штангой на верхней части спины."
    },
    "barbell-bench-press": {
      "name": "Жим штанги лежа",
      "description": "Фундаментальное базовое упражнение для развития силы верхней части тела, в основном нацеленное на грудь, плечи и трицепсы."
    },
    "barbell-back-squat": {
      "name": "Приседание со штангой на спине",
      "description": "Основное силовое упражнение, нацеленное на квадрицепсы, ягодицы, бицепсы бедра и низ спины, выполняемое путем приседания со штангой на верхней части спины."
    },
    "barbell-deadlift": {
      "name": "Становая тяга со штангой (классическая)",
      "description": "Базовое упражнение для всего тела, заключающееся в подъеме штанги с пола до полного выпрямления, задействующее ноги, спину и кор."
    },
    "overhead-press-barbell": {
      "name": "Жим штанги стоя (армейский жим)",
      "description": "Базовое упражнение для плеч, заключающееся в жиме штанги над головой из положения стоя или сидя."
    },
    "bent-over-row-barbell": {
      "name": "Тяга штанги в наклоне",
      "description": "Базовое упражнение для спины, в котором штанга подтягивается к туловищу в положении наклона корпуса вперед."
    },
    "barbell-bicep-curl": {
      "name": "Сгибание рук на бицепс со штангой",
      "description": "Изолирующее упражнение для бицепсов с использованием штанги."
    },
    "barbell-romanian-deadlift": {
      "name": "Румынская становая тяга со штангой (RDL)",
      "description": "Нацелено на бицепсы бедра и ягодицы путем сгибания в тазобедренных суставах с легким сгибанием коленей, удерживая штангу близко к ногам."
    },
    "dumbbell-bench-press": {
      "name": "Жим гантелей лежа",
      "description": "Базовое упражнение, нацеленное на грудь, плечи и трицепсы, выполняемое с гантелями на скамье, что позволяет увеличить амплитуду движения."
    },
    "dumbbell-shoulder-press": {
      "name": "Жим гантелей на плечи",
      "description": "Базовое упражнение для плеч, заключающееся в жиме гантелей над головой, что позволяет рукам двигаться независимо друг от друга."
    },
    "dumbbell-row": {
      "name": "Тяга гантели в наклоне (одной рукой)",
      "description": "Одностороннее упражнение для спины, нацеленное на широчайшие, ромбовидные мышцы и бицепсы, обычно выполняемое с опорой коленом и рукой на скамью."
    },
    "dumbbell-bicep-curl": {
      "name": "Сгибание рук на бицепс с гантелями",
      "description": "Изолирующее упражнение для бицепсов с использованием гантелей, позволяющее выполнять супинацию (поворот запястья)."
    },
    "dumbbell-tricep-extension-overhead": {
      "name": "Разгибание на трицепс с гантелью из-за головы",
      "description": "Изолирующее упражнение для трицепсов, выполняемое путем разгибания руки с гантелью над головой."
    },
    "dumbbell-lunge": {
      "name": "Выпады с гантелями",
      "description": "Выпады, выполняемые с гантелями в руках, что добавляет сопротивление для нижней части тела."
    },
    "dumbbell-romanian-deadlift": {
      "name": "Румынская становая тяга с гантелями (RDL)",
      "description": "Нацелено на бицепсы бедра и ягодицы с использованием гантелей, с акцентом на движение в тазобедренных суставах."
    },
    "goblet-squat": {
      "name": "Кубковое приседание",
      "description": "Вариант приседания с удержанием одной гантели или гири на уровне груди, что способствует поддержанию вертикального положения туловища."
    },
    "dumbbell-lateral-raise": {
      "name": "Махи гантелями в стороны",
      "description": "Изолирующее упражнение для средних (боковых) дельтовидных мышц, заключающееся в подъеме гантелей в стороны."
    },
    "dumbbell-front-raise": {
      "name": "Подъемы гантелей перед собой",
      "description": "Изолирующее упражнение для передних дельтовидных мышц, заключающееся в подъеме гантелей вперед."
    },
    "kettlebell-swing": {
      "name": "Махи гирей (двумя руками)",
      "description": "Динамичное, взрывное упражнение, нацеленное на заднюю мышечную цепь (ягодицы, бицепсы бедра, спина) и улучшающее взрывную силу."
    },
    "kettlebell-goblet-squat": {
      "name": "Кубковое приседание с гирей",
      "description": "Приседание с удержанием гири за ручки на уровне груди, отлично подходит для отработки техники и вовлечения мышц кора."
    },
    "kettlebell-clean-and-press": {
      "name": "Взятие гири на грудь и жим",
      "description": "Базовое движение для всего тела, включающее взятие гири на грудь в позицию \"рэк\" и последующий жим над головой."
    },
    "turkish-get-up": {
      "name": "Турецкий подъем (TGU)",
      "description": "Сложное упражнение для всего тела, включающее переход из положения лежа на полу в положение стоя, все время удерживая гирю (или гантель) над головой. Улучшает стабильность, мобильность и силу."
    },
    "kettlebell-single-arm-row": {
      "name": "Тяга гири одной рукой",
      "description": "Одностороннее упражнение для спины, нацеленное на широчайшие, ромбовидные мышцы и бицепсы, выполняемое путем подтягивания гири к туловищу, часто с опорой одной рукой и коленом на скамью."
    },
    "kettlebell-deadlift": {
      "name": "Становая тяга с гирей",
      "description": "Фундаментальное силовое упражнение с использованием одной или двух гирь для проработки задней мышечной цепи, с акцентом на движение в тазобедренных суставах. Может выполняться с гирей (гирями) между ног или сбоку (стиль \"чемодан\")."
    },
    "kettlebell-strict-press": {
      "name": "Строгий жим гири (одной рукой)",
      "description": "Упражнение для жима над головой для развития силы плеч и трицепсов, выполняемое одной гирей из позиции \"рэк\" без использования толчка ногами."
    },
    "kettlebell-rack-lunge": {
      "name": "Выпады с гирей (в позиции \"рэк\")",
      "description": "Одностороннее упражнение для ног, которое развивает силу, стабильность и вовлечение кора, выполняемое с удержанием одной или двух гирь в передней позиции \"рэк\"."
    },
    "kettlebell-windmill": {
      "name": "Мельница с гирей",
      "description": "Сложное упражнение, которое улучшает стабильность плеч, мобильность тазобедренных суставов и силу кора, включающее боковой наклон в тазобедренных суставах, удерживая гирю вытянутой над головой."
    },
    "kettlebell-russian-twist": {
      "name": "Русский твист с гирей",
      "description": "Упражнение для кора, нацеленное на косые и прямую мышцы живота, выполняемое сидя со согнутыми коленями и оторванными от пола ногами (по желанию), скручивая туловище из стороны в сторону, удерживая гирю."
    },
    "kettlebell-high-pull": {
      "name": "Тяга гири к подбородку",
      "description": "Взрывное упражнение, развивающее мощность в тазобедренных суставах, спине и плечах. Включает подтягивание гири из маха (или с пола) до уровня подбородка, удерживая локоть высоко."
    },
    "kettlebell-figure-8": {
      "name": "Восьмерка с гирей",
      "description": "Динамичное упражнение, улучшающее координацию, стабильность кора и силу хвата путем передачи гири между и вокруг ног по траектории восьмерки."
    },
    "kettlebell-suitcase-carry": {
      "name": "Прогулка фермера с гирей в одной руке (чемодан)",
      "description": "Одностороннее упражнение с отягощением, которое бросает вызов стабильности кора, силе хвата и осанке, заключающееся в переносе тяжелой гири в одной руке, как чемодан."
    },
    "kettlebell-thruster": {
      "name": "Трастер с гирей",
      "description": "Базовое упражнение для всего тела, сочетающее в себе фронтальное приседание с гирей и жим над головой в одном плавном движении. Может выполняться с одной или двумя гирями."
    },
    "lat-pulldown-machine": {
      "name": "Тяга верхнего блока (на тренажере)",
      "description": "Упражнение на тренажере, нацеленное на широчайшие мышцы спины, путем подтягивания рукоятки вниз к груди."
    },
    "seated-row-machine": {
      "name": "Горизонтальная тяга в блочном тренажере",
      "description": "Упражнение на тренажере для увеличения толщины спины, нацеленное на средние мышцы спины, путем подтягивания рукояток к туловищу."
    },
    "leg-press-machine": {
      "name": "Жим ногами (на тренажере)",
      "description": "Базовое упражнение для нижней части тела, выполняемое на тренажере, путем отталкивания утяжеленной платформы ногами."
    },
    "leg-extension-machine": {
      "name": "Разгибание ног (на тренажере)",
      "description": "Изолирующее упражнение для квадрицепсов, заключающееся в разгибании голеней против сопротивления."
    },
    "leg-curl-machine": {
      "name": "Сгибание ног (на тренажере - лежа или сидя)",
      "description": "Изолирующее упражнение для бицепсов бедра, заключающееся в сгибании голеней к ягодицам против сопротивления."
    },
    "chest-press-machine": {
      "name": "Жим от груди (на тренажере)",
      "description": "Базовое упражнение для груди на тренажере, похожее на жим лежа, но с фиксированной траекторией движения."
    },
    "shoulder-press-machine": {
      "name": "Жим на плечи (на тренажере)",
      "description": "Упражнение на тренажере для плеч, заключающееся в жиме рукояток над головой по заданной траектории."
    },
    "pec-deck-fly-machine": {
      "name": "Сведение рук в тренажере \"бабочка\"",
      "description": "Изолирующее упражнение для груди, заключающееся в сведении рук вместе в движении, похожем на взмах крыльев, с использованием тренажера."
    },
    "reverse-pec-deck-machine": {
      "name": "Обратная \"бабочка\" (разведение рук на задние дельты)",
      "description": "Упражнение на тренажере, нацеленное на задние дельтовидные мышцы (задние пучки плеч) и мышцы верхней части спины."
    },
    "calf-raise-machine": {
      "name": "Подъемы на икры (на тренажере - стоя или сидя)",
      "description": "Изолирующее упражнение для икроножных мышц (икроножной и камбаловидной)."
    },
    "cable-tricep-pushdown": {
      "name": "Разгибание на трицепс на блоке (с канатом или рукояткой)",
      "description": "Изолирующее упражнение для трицепсов с использованием блочного тренажера с канатным или прямым грифом."
    },
    "cable-bicep-curl": {
      "name": "Сгибание на бицепс на блоке (с грифом или рукоятками)",
      "description": "Изолирующее упражнение для бицепсов с использованием блочного тренажера, обеспечивающего постоянное напряжение."
    },
    "cable-face-pull": {
      "name": "Тяга к лицу на блоке",
      "description": "Отличное упражнение для задних дельтовидных мышц, здоровья вращательной манжеты плеча и осанки верхней части спины."
    },
    "cable-fly": {
      "name": "Кроссовер (стоя - верхний, средний или нижний блок)",
      "description": "Изолирующее упражнение для груди с использованием блочного тренажера, позволяющее работать под различными углами для проработки разных частей груди."
    },
    "cable-lateral-raise": {
      "name": "Махи в стороны на блоке",
      "description": "Изолирующее упражнение для средних дельтовидных мышц с использованием блока, обеспечивающего постоянное напряжение на протяжении всего движения."
    },
    "cable-woodchop": {
      "name": "Дровосек на блоке (сверху вниз или снизу вверх)",
      "description": "Ротационное упражнение для кора, задействующее косые и поперечную мышцы живота."
    },
    "resistance-band-bicep-curl": {
      "name": "Сгибание на бицепс с резиновой лентой",
      "description": "Сгибания на бицепс, выполняемые с резиновой лентой, обеспечивающей переменное сопротивление."
    },
    "resistance-band-tricep-pushdown": {
      "name": "Разгибание на трицепс с резиновой лентой",
      "description": "Разгибания на трицепс с использованием резиновой ленты, закрепленной сверху или удерживаемой."
    },
    "resistance-band-pull-apart": {
      "name": "Разведение резиновой ленты",
      "description": "Отличное упражнение для здоровья плеч, нацеленное на задние дельтовидные мышцы и мышцы верхней части спины."
    },
    "resistance-band-squat": {
      "name": "Приседание с резиновой лентой",
      "description": "Приседания, выполняемые с резиновой лентой под ногами и накинутой на плечи или удерживаемой в руках, для добавления сопротивления."
    },
    "resistance-band-glute-bridge": {
      "name": "Ягодичный мостик с резиновой лентой",
      "description": "Ягодичные мостики с резиновой лентой вокруг бедер для дополнительной активации средней ягодичной мышцы."
    },
    "farmers-walk": {
      "name": "Прогулка фермера",
      "description": "Упражнение для всего тела, заключающееся в ходьбе на расстояние с тяжелыми весами (гантели, гири или специальные рукоятки). Улучшает силу хвата, стабильность кора и общую физическую подготовку."
    },
    "box-jump": {
      "name": "Запрыгивание на ящик",
      "description": "Плиометрическое упражнение, которое включает запрыгивание на возвышенную платформу, развивая взрывную силу нижней части тела."
    },
    "medicine-ball-slam": {
      "name": "Бросок медицинского мяча об пол",
      "description": "Упражнение на развитие мощности для всего тела, включающее подъем медицинского мяча над головой и его сильный бросок на землю."
    },
    "glute-bridge": {
      "name": "Ягодичный мостик",
      "description": "Упражнение с собственным весом, нацеленное на ягодицы и бицепсы бедра, путем подъема таза от пола."
    },
    "superman-exercise": {
      "name": "Супермен",
      "description": "Упражнение с собственным весом, которое укрепляет низ спины, ягодицы и бицепсы бедра путем одновременного подъема рук и ног от пола в положении лежа на животе."
    },
    "mountain-climbers": {
      "name": "Скалолаз",
      "description": "Динамичное упражнение для всего тела, которое развивает кардиовыносливость, силу кора и ловкость, имитируя движение скалолазания."
    },
    "bench-dips": {
      "name": "Обратные отжимания от скамьи (на трицепс)",
      "description": "Упражнение с собственным весом, нацеленное на трицепсы, выполняемое с использованием скамьи или стула."
    },
    "bodyweight-calf-raise": {
      "name": "Подъемы на икры с собственным весом",
      "description": "Простое, но эффективное упражнение с собственным весом для укрепления икроножных мышц."
    },
    "barbell-hip-thrust": {
      "name": "Ягодичный мост со штангой",
      "description": "Мощное упражнение для ягодиц, выполняемое путем подъема таза вверх со штангой, лежащей на бедрах, обычно с опорой верхней частью спины на скамью."
    },
    "barbell-front-squat": {
      "name": "Фронтальное приседание со штангой",
      "description": "Вариант приседания, при котором штанга удерживается на передней части плеч, что акцентирует нагрузку на квадрицепсы и стабильность кора."
    },
    "barbell-good-morning": {
      "name": "Наклоны со штангой (\"Доброе утро\")",
      "description": "Упражнение, нацеленное на заднюю мышечную цепь (бицепсы бедра, ягодицы, низ спины), выполняемое путем наклона в тазобедренных суставах со штангой на верхней части спины."
    },
    "dumbbell-incline-press": {
      "name": "Жим гантелей на наклонной скамье",
      "description": "Нацелено на верхнюю часть груди, плечи и трицепсы путем жима гантелей на наклонной скамье."
    },
    "dumbbell-fly": {
      "name": "Разводка гантелей",
      "description": "Изолирующее упражнение для груди, выполняемое путем разведения и сведения рук по дугообразной траектории с гантелями в руках."
    },
    "dumbbell-hammer-curl": {
      "name": "Сгибание рук \"молот\"",
      "description": "Вариант сгибания на бицепс с нейтральным хватом (ладони обращены друг к другу), нацеленный на брахиалис и брахиорадиалис в дополнение к бицепсам."
    },
    "dumbbell-tricep-kickback": {
      "name": "Разгибание на трицепс с гантелью в наклоне",
      "description": "Изолирующее упражнение для трицепсов, выполняемое путем разгибания руки назад в положении наклона корпуса."
    },
    "dumbbell-bulgarian-split-squat": {
      "name": "Болгарский сплит-присед с гантелями",
      "description": "Одностороннее упражнение для ног с задней ногой на возвышении, нацеленное на квадрицепсы, ягодицы и бицепсы бедра, при этом улучшая баланс."
    },
    "dumbbell-pullover": {
      "name": "Пуловер с гантелью",
      "description": "Упражнение, которое прорабатывает грудь и широчайшие мышцы спины, выполняемое лежа на скамье путем опускания гантели за голову."
    },
    "kettlebell-snatch": {
      "name": "Рывок гири",
      "description": "Взрывное упражнение для всего тела, в котором гиря махом поднимается с положения между ног до вытянутой руки над головой одним плавным движением."
    },
    "kettlebell-halo": {
      "name": "Нимб с гирей",
      "description": "Упражнение на мобильность и стабильность плеч, включающее круговое движение гирей вокруг головы."
    },
    "hack-squat-machine": {
      "name": "Гакк-приседания (на тренажере)",
      "description": "Вариант приседаний на тренажере, который нацелен на квадрицепсы, часто с акцентом на их внешнюю часть."
    },
    "seated-calf-raise-machine": {
      "name": "Подъемы на икры сидя (на тренажере)",
      "description": "Изолирующее упражнение для камбаловидной мышцы икры, выполняемое на тренажере в положении сидя."
    },
    "abdominal-crunch-machine": {
      "name": "Скручивания на пресс (на тренажере)",
      "description": "Упражнение на тренажере для изоляции прямых мышц живота."
    },
    "back-extension-machine": {
      "name": "Гиперэкстензия (на тренажере)",
      "description": "Укрепляет низ спины, ягодицы и бицепсы бедра с использованием скамьи для гиперэкстензии или тренажера."
    },
    "cable-overhead-tricep-extension": {
      "name": "Разгибание на трицепс из-за головы на блоке (с канатом)",
      "description": "Нацелено на длинную головку трицепса с использованием блочного тренажера и канатного грифа."
    },
    "cable-pull-through": {
      "name": "Тяга блока через ноги",
      "description": "Упражнение на сгибание в тазобедренных суставах, которое нацелено на ягодицы и бицепсы бедра с использованием блочного тренажера."
    },
    "cable-reverse-fly": {
      "name": "Обратная разводка на блоке",
      "description": "Нацелено на задние дельтовидные мышцы и мышцы верхней части спины с использованием блочного тренажера с двумя рукоятками."
    },
    "cable-torso-twist": {
      "name": "Повороты корпуса на блоке (стоя)",
      "description": "Упражнение для кора, нацеленное на косые мышцы живота через ротационное движение против сопротивления блока."
    },
    "resistance-band-chest-press": {
      "name": "Жим от груди с резиновой лентой",
      "description": "Вариант жима от груди с использованием резиновых лент, можно выполнять стоя или лежа."
    },
    "resistance-band-row": {
      "name": "Тяга с резиновой лентой (сидя или стоя)",
      "description": "Нацелено на мышцы спины с использованием резиновой ленты, которую можно закрепить или удерживать."
    },
    "resistance-band-deadlift": {
      "name": "Становая тяга с резиновой лентой",
      "description": "Вариант становой тяги с использованием резиновых лент, хорошо подходит для изучения техники или для легких тренировочных дней."
    },
    "resistance-band-lateral-walk": {
      "name": "Боковая ходьба с резиновой лентой (ходьба краба)",
      "description": "Нацелено на среднюю ягодичную мышцу и отводящие мышцы бедра, выполняется путем ходьбы вбок с лентой вокруг лодыжек или коленей."
    },
    "hamstring-stretch": {
      "name": "Растяжка бицепса бедра (стоя/сидя)",
      "description": "Статическая растяжка для улучшения гибкости мышц задней поверхности бедра."
    },
    "quadriceps-stretch": {
      "name": "Растяжка квадрицепса (стоя)",
      "description": "Статическая растяжка для квадрицепсов, обычно выполняемая путем подтягивания пятки к ягодице."
    },
    "chest-stretch-doorway": {
      "name": "Растяжка грудных мышц (в дверном проеме)",
      "description": "Статическая растяжка для грудных мышц с использованием дверного проема в качестве опоры."
    },
    "triceps-stretch": {
      "name": "Растяжка трицепса (над головой)",
      "description": "Статическая растяжка для трицепсов, выполняемая путем поднятия одной руки над головой и сгибания в локте."
    },
    "cat-cow-stretch": {
      "name": "Растяжка \"Кошка-корова\"",
      "description": "Динамическая растяжка, которая улучшает подвижность позвоночника и снимает напряжение в спине и коpe."
    },
    "childs-pose": {
      "name": "Поза ребенка",
      "description": "Мягкая поза для отдыха, которая успокаивает ум и помогает снять стресс и усталость. Она мягко растягивает бедра, ляжки и лодыжки."
    },
    "jumping-jacks": {
      "name": "Прыжки \"Джампинг Джек\"",
      "description": "Классическое калистеническое упражнение для всего тела, которое служит хорошей разминкой или кардио-всплеском."
    },
    "high-knees": {
      "name": "Бег с высоким подниманием колен",
      "description": "Интенсивное кардио-упражнение, включающее бег на месте с подъемом колен как можно выше."
    },
    "running-jogging": {
      "name": "Бег/Пробежка",
      "description": "Эффективное сердечно-сосудистое упражнение, которое улучшает выносливость и сжигает калории."
    },
    "cycling": {
      "name": "Велосипед",
      "description": "Низкоударное сердечно-сосудистое упражнение, которое в основном прорабатывает мышцы ног."
    },
    "jump-rope": {
      "name": "Прыжки на скакалке",
      "description": "Очень эффективное сердечно-сосудистое упражнение, которое улучшает координацию, ловкость и сжигает значительное количество калорий."
    },
    "elliptical-trainer": {
      "name": "Эллиптический тренажер",
      "description": "Низкоударный кардиотренажер, который имитирует подъем по лестнице, ходьбу или бег, не создавая избыточного давления на суставы."
    },
    "stair-climbing": {
      "name": "Подъем по лестнице",
      "description": "Энергичное сердечно-сосудистое упражнение, которое нацелено на ягодицы, квадрицепсы и бицепсы бедра."
    },
    "sled-push": {
      "name": "Толкание саней",
      "description": "Упражнение на силу и выносливость для всего тела, включающее толкание утяжеленных саней."
    },
    "sled-pull": {
      "name": "Тяга саней",
      "description": "Упражнение на силу и выносливость для всего тела, включающее тягу утяжеленных саней с помощью ремней или упряжи."
    },
    "tire-flip": {
      "name": "Кантование покрышки",
      "description": "Мощное упражнение для всего тела, распространенное в тренировках стронгменов, включающее переворачивание большой покрышки."
    },
    "battle-ropes": {
      "name": "Боевые канаты",
      "description": "Высокоинтенсивное, низкоударное упражнение, которое прорабатывает верхнюю часть тела, кор и представляет собой серьезную сердечно-сосудистую нагрузку."
    },

    "alternating-proprioceptive-reverse-lunge": {
      "name": "Чередующиеся проприоцептивные обратные выпады",
      "description": "Вариант обратных выпадов, который развивает равновесие и осознание тела за счет чередования ног при каждом повторении, часто выполняется на неустойчивой поверхности или с закрытыми глазами для усиления проприоцепции."
    },
    "rehab-ankle-pumps": {
      "name": "Движения голеностопом",
      "description": "Простое упражнение на подвижность, включающее сгибание и разгибание голеностопных суставов, часто используется для улучшения кровообращения и диапазона движений после травмы или бездействия."
    },
    "archer-push-up": {
      "name": "Отжимания лучника",
      "description": "Односторонний вариант отжиманий, при котором одна рука вытянута в сторону, а другая выполняет отжимание, развивая силу и контроль с одной стороны."
    },
    "barbell-skull-crusher": {
      "name": "Французский жим со штангой",
      "description": "Изолирующее упражнение для трицепсов, выполняемое лежа на скамье; штанга опускается ко лбу, после чего локти разгибаются."
    },
    "bird-dog": {
      "name": "Птица-собака",
      "description": "Упражнение на стабильность кора, при котором вы одновременно вытягиваете противоположные руку и ногу, стоя на четвереньках, улучшая равновесие и стабильность позвоночника."
    },
    "rehab-bird-dog-stability": {
      "name": "Птица-собака (с акцентом на стабильность)",
      "description": "Вариант упражнения «Птица-собака» с акцентом на медленные, контролируемые движения и удержания для максимальной стабилизации и контроля кора."
    },
    "bulgarian-bag-arm-throw": {
      "name": "Бросок болгарского мешка рукой",
      "description": "Динамичное вращательное упражнение с использованием болгарского мешка, включающее махи и броски мешка через тело для развития силы кора и координации."
    },
    "bulgarian-bag-snatch": {
      "name": "Рывок болгарского мешка",
      "description": "Взрывное движение для всего тела, при котором болгарский мешок одним плавным движением поднимается из положения между ног над головой."
    },
    "bulgarian-bag-spin": {
      "name": "Вращение болгарского мешка",
      "description": "Фирменное упражнение с болгарским мешком, включающее вращение мешка вокруг головы и тела, развивающее стабильность плеч, силу кора и хват."
    },
    "bulgarian-bag-suplex": {
      "name": "Суплекс с болгарским мешком",
      "description": "Упражнение, направленное на развитие силы, имитирующее борцовский суплекс, включающее подъем и бросок болгарского мешка через плечо."
    },
    "burpee-box-jump": {
      "name": "Берпи с запрыгиванием на ящик",
      "description": "Высокоинтенсивный вариант берпи, в котором финальный прыжок выполняется на возвышенную платформу (ящик), что увеличивает плиометрическую нагрузку."
    },
    "cable-seated-row": {
      "name": "Тяга в блочном тренажере сидя",
      "description": "Упражнение на тренажере для увеличения толщины спины, нацеленное на мышцы середины спины; выполняется путем притягивания рукояток к туловищу из положения сидя."
    },
    "calf-stretch": {
      "name": "Растяжка икроножных мышц",
      "description": "Упражнение на гибкость для растяжения икроножной и камбаловидной мышц, обычно выполняется у стены или на ступеньке."
    },
    "chin-tucks-cervical-retraction": {
      "name": "Втягивание подбородка (ретракция шеи)",
      "description": "Упражнение для осанки для исправления сутулости, выполняется путем мягкого втягивания головы и шеи назад, укрепляя глубокие сгибатели шеи."
    },
    "rehab-clamshells": {
      "name": "Ракушка",
      "description": "Упражнение на отведение бедра, выполняемое лежа на боку для укрепления средней ягодичной мышцы, которая важна для стабильности бедра."
    },
    "clubbell-barbarian-squat": {
      "name": "Варварские приседания с булавой",
      "description": "Сложное упражнение, сочетающее приседание с вращательными движениями булавой, развивающее координацию, силу кора и мощность нижней части тела."
    },
    "clubbell-gamma-cast": {
      "name": "Гамма-бросок с булавой",
      "description": "Базовое упражнение с булавой, включающее маятниковые махи перед собой из стороны в сторону, развивающее хват, силу плеч и кора."
    },
    "clubbell-mill": {
      "name": "Мельница с булавой",
      "description": "Силовое упражнение с круговым движением, при котором булава вращается вокруг тела по траектории, похожей на мельницу, улучшая подвижность и стабильность плеч."
    },
    "clubbell-shield-cast": {
      "name": "Бросок щита с булавой",
      "description": "Основное движение с булавой, при котором булава забрасывается за плечо защитным движением «щит», отлично подходит для подвижности плеч и грудного отдела."
    },
    "crab-walk": {
      "name": "Ходьба крабом",
      "description": "Упражнение с собственным весом, выполняемое путем ходьбы на руках и ногах лицом вверх, задействуя трицепсы, плечи, ягодицы и бицепсы бедра."
    },
    "dead-bug": {
      "name": "Мертвый жук",
      "description": "Упражнение для кора, при котором вы лежите на спине и медленно опускаете противоположные руки и ноги, улучшая пояснично-тазовую стабильность без нагрузки на спину."
    },
    "decline-push-up": {
      "name": "Отжимания с ногами на возвышенности",
      "description": "Вариант отжиманий с поднятыми ногами, что увеличивает нагрузку на верхнюю часть груди и плечи."
    },
    "dolphin-plank": {
      "name": "Планка-дельфин",
      "description": "Продвинутый вариант планки на предплечьях, включающий подъем и опускание таза для нагрузки на плечи и кор."
    },
    "double-kettlebell-alternating-clean": {
      "name": "Поочередное взятие на грудь двух гирь",
      "description": "Упражнение с двумя гирями, в котором вы поочередно поднимаете каждую из них в положение на груди, развивая координацию и стабильность кора."
    },
    "double-kettlebell-alternating-floor-press": {
      "name": "Поочередный жим двух гирь лежа на полу",
      "description": "Жим лежа на полу с двумя гирями, при котором вы жмете по одной руке за раз, заставляя кор сопротивляться вращению."
    },
    "double-kettlebell-alternating-rotational-press": {
      "name": "Поочередный вращательный жим двух гирь",
      "description": "Жим над головой с двумя гирями, включающий вращение туловища при жиме каждой гири поочередно."
    },
    "double-kettlebell-alternating-snatch": {
      "name": "Поочередный рывок двух гирь",
      "description": "Взрывное упражнение, в котором вы поочередно выполняете рывок каждой гири над головой непрерывным, плавным движением."
    },
    "double-kettlebell-arching-swing": {
      "name": "Махи двумя гирями по дуге",
      "description": "Вариант махов, при котором две гири движутся по дуге снаружи ног, нагружая бедра и кор иначе, чем стандартные махи."
    },
    "double-kettlebell-bent-over-row": {
      "name": "Тяга двух гирь в наклоне",
      "description": "Силовое упражнение для спины, выполняемое в наклоне с гирей в каждой руке."
    },
    "double-kettlebell-clean": {
      "name": "Взятие на грудь двух гирь",
      "description": "Силовое упражнение, при котором две гири одновременно поднимаются из маха в положение на груди."
    },
    "double-kettlebell-clean-and-jerk": {
      "name": "Толчок двух гирь",
      "description": "Баллистическое упражнение для всего тела, сочетающее взятие двух гирь на грудь с мощным толчком для подъема обеих гирь над головой."
    },
    "double-kettlebell-clean-and-push-press": {
      "name": "Взятие на грудь и швунг двух гирь",
      "description": "Комбинированное движение, сочетающее взятие двух гирь на грудь со швунгом, используя ноги для помощи в жиме гирь над головой."
    },
    "double-kettlebell-clean-to-reverse-lunge": {
      "name": "Взятие на грудь двух гирь с обратным выпадом",
      "description": "Комплекс, который сочетает взятие двух гирь на грудь с обратным выпадом на каждую ногу перед повторением."
    },
    "double-kettlebell-complex-clean-squat-press": {
      "name": "Комплекс с двумя гирями (взятие-присед-жим)",
      "description": "Последовательность, в которой вы выполняете взятие двух гирь на грудь, затем фронтальный присед, а затем жим над головой в одном непрерывном комплексе."
    },
    "double-kettlebell-deadlift-to-swing": {
      "name": "Тяга двух гирь с переходом в мах",
      "description": "Упражнение, которое начинается с тяги двух гирь и плавно переходит в мах, помогая отработать тазобедренный шарнир."
    },
    "double-kettlebell-farmers-squat": {
      "name": "Фермерские приседания с двумя гирями",
      "description": "Вариант приседаний, выполняемый с двумя гирями по бокам (в положении фермерской прогулки), сильно задействуя трапеции и кор."
    },
    "double-kettlebell-floor-press": {
      "name": "Жим двух гирь лежа на полу",
      "description": "Упражнение для груди и трицепсов, выполняемое лежа на полу; жим двух гирь вверх. Пол ограничивает диапазон движения, фокусируясь на силе локаута."
    },
    "double-kettlebell-front-squat": {
      "name": "Фронтальные приседания с двумя гирями",
      "description": "Приседания, выполняемые с двумя гирями в положении на груди, интенсивно нагружая квадрицепсы, ягодицы и кор."
    },
    "double-kettlebell-front-squat-to-press-out": {
      "name": "Фронтальные приседания с выталкиванием двух гирь",
      "description": "Сочетает фронтальный присед с двумя гирями с изометрическим выталкиванием в нижней точке приседа, увеличивая вовлечение кора и плеч."
    },
    "double-kettlebell-gorilla-row": {
      "name": "Тяга гориллы с двумя гирями",
      "description": "Поочередная тяга, выполняемая из глубокого наклона с двумя гирями на полу, развивая силу и стабильность спины."
    },
    "double-kettlebell-offset-carry-overhead-rack": {
      "name": "Асимметричная прогулка с гирями (над головой/на груди)",
      "description": "Прогулка с отягощением, при которой одна гиря удерживается над головой, а другая — на груди, создавая серьезную нагрузку на стабильность кора и плеч."
    },
    "double-kettlebell-offset-squat-rack-suitcase": {
      "name": "Асимметричные приседания с гирями (на груди/в руке)",
      "description": "Приседание, выполняемое с одной гирей на груди, а другой — сбоку (как чемодан), бросая вызов анти-боковому сгибанию."
    },
    "double-kettlebell-overhead-carry": {
      "name": "Прогулка с двумя гирями над головой",
      "description": "Прогулка с отягощением, включающая ходьбу с двумя гирями, зафиксированными над головой, развивая огромную стабильность плеч и кора."
    },
    "double-kettlebell-overhead-lunge": {
      "name": "Выпады с двумя гирями над головой",
      "description": "Выпады, выполняемые с двумя гирями над головой, требующие значительной стабильности и силы всего тела."
    },
    "double-kettlebell-press": {
      "name": "Жим двух гирь над головой",
      "description": "Силовое упражнение для плеч, включающее жим двух гирь из положения на груди над головой."
    },
    "double-kettlebell-push-press": {
      "name": "Швунг двух гирь",
      "description": "Взрывной жим над головой, который использует подсед и толчок ногами для помощи в подъеме двух гирь над головой."
    },
    "double-kettlebell-push-up-to-renegade-row": {
      "name": "Отжимание с тягой ренегата с двумя гирями",
      "description": "Комплекс, включающий отжимание на двух гирях, с последующей тягой каждой гири к груди поочередно."
    },
    "double-kettlebell-rack-deadlift": {
      "name": "Тяга с двумя гирями на груди",
      "description": "Вариант тяги, при котором гири удерживаются в положении на груди, что делает сильный акцент на квадрицепсы и кор."
    },
    "double-kettlebell-renegade-row": {
      "name": "Тяга ренегата с двумя гирями",
      "description": "Из положения планки на двух гирях вы поочередно тянете каждую гирю к груди, бросая вызов стабильности кора и силе спины."
    },
    "double-kettlebell-rotational-press": {
      "name": "Вращательный жим двух гирь",
      "description": "Жим над головой, который включает в себя поворот и вращение туловища для создания мощности."
    },
    "double-kettlebell-see-saw-press": {
      "name": "Жим двух гирь «Качели»",
      "description": "Поочередный жим над головой, при котором, когда одна гиря поднимается, другая опускается, создавая постоянное напряжение и вызов для стабильности."
    },
    "double-kettlebell-see-saw-row": {
      "name": "Тяга двух гирь «Качели»",
      "description": "Поочередная тяга в наклоне, при которой, когда одна гиря поднимается, другая опускается, бросая вызов спине и кору."
    },
    "double-kettlebell-snatch": {
      "name": "Рывок двух гирь",
      "description": "Очень атлетичное движение, при котором две гири из маха одним взрывным движением фиксируются над головой."
    },
    "double-kettlebell-split-jerk": {
      "name": "Толчок двух гирь в разножку",
      "description": "Мощный вариант толчка, при котором вы делаете подсед, толчок и уход под гири в разножку, чтобы принять их над головой."
    },
    "double-kettlebell-split-snatch": {
      "name": "Рывок двух гирь в разножку",
      "description": "Продвинутый вариант рывка, при котором вы ловите две гири над головой, переставляя ноги в разножку."
    },
    "double-kettlebell-suitcase-deadlift": {
      "name": "Тяга «чемодан» с двумя гирями",
      "description": "Тяга, выполняемая с гирей с внешней стороны каждой ноги, бросая вызов ногам, спине и стабильности кора."
    },
    "double-kettlebell-sumo-deadlift": {
      "name": "Тяга сумо с двумя гирями",
      "description": "Тяга, выполняемая в широкой стойке (сумо), с двумя гирями между ног, акцентируя внимание на ягодицах и бедрах."
    },
    "double-kettlebell-thruster": {
      "name": "Трастер с двумя гирями",
      "description": "Комбинированное упражнение для всего тела, сочетающее фронтальный присед с двумя гирями и жим над головой в одном плавном движении."
    },
    "double-kettlebell-walking-lunge": {
      "name": "Ходьба выпадами с двумя гирями",
      "description": "Ходьба выпадами, выполняемая с двумя гирями, обычно в положении на груди или в опущенных руках, чтобы добавить значительную нагрузку."
    },
    "double-kettlebell-windmill": {
      "name": "Мельница с двумя гирями",
      "description": "Продвинутый вариант мельницы, при котором вы держите одну гирю над головой и наклоняетесь, чтобы поднять вторую с пола, требуя огромной стабильности и мобильности."
    },
    "dumbbell-arnold-press": {
      "name": "Жим Арнольда с гантелями",
      "description": "Вариант жима для плеч, который включает вращение для проработки всех трех головок дельтовидной мышцы."
    },
    "dumbbell-concentration-curl": {
      "name": "Концентрированные сгибания с гантелью",
      "description": "Сгибание на бицепс сидя, при котором локоть упирается во внутреннюю часть бедра для изоляции бицепса."
    },
    "dumbbell-incline-bench-press": {
      "name": "Жим гантелей на наклонной скамье",
      "description": "Нацелено на верхнюю часть груди, плечи и трицепсы путем жима гантелей на наклонной скамье."
    },
    "dumbbell-incline-fly": {
      "name": "Разведение гантелей на наклонной скамье",
      "description": "Изолирующее упражнение для верхней части груди, выполняемое на наклонной скамье; руки разводятся и сводятся по широкой дуге."
    },
    "dumbbell-overhead-lunge": {
      "name": "Выпады с гантелями над головой",
      "description": "Выпады, выполняемые с одной или двумя гантелями над головой, бросая вызов равновесию, стабильности плеч и силе кора."
    },
    "dumbbell-pistol-squat-double": {
      "name": "Приседание «пистолетик» с двумя гантелями",
      "description": "Приседание на одной ноге, выполняемое с двумя гантелями, обычно у плеч или по бокам, что значительно увеличивает нагрузку."
    },
    "dumbbell-pistol-squat-single": {
      "name": "Приседание «пистолетик» с одной гантелью",
      "description": "Приседание на одной ноге, выполняемое с одной гантелью, часто в положении «кубок», чтобы служить противовесом и добавлять сопротивление."
    },
    "dumbbell-row-to-deadlift-complex": {
      "name": "Комплекс: тяга гантели с румынской тягой",
      "description": "Последовательность, сочетающая румынскую тягу с гантелями и тягу в наклоне в каждом повторении."
    },
    "dumbbell-tate-press": {
      "name": "Жим Тейта с гантелями",
      "description": "Упражнение для трицепсов, выполняемое лежа на скамье, при котором гантели опускаются к груди с разведенными локтями, а затем выжимаются обратно."
    },
    "explosive-clap-push-up": {
      "name": "Взрывные отжимания с хлопком",
      "description": "Плиометрическое отжимание, при котором вы взрывным движением отталкиваетесь от пола с достаточной силой, чтобы хлопнуть в ладоши в воздухе."
    },
    "frog-stand": {
      "name": "Стойка лягушки",
      "description": "Базовая стойка на руках в гимнастике и йоге, при которой вы балансируете коленями на локтях в сгруппированном положении."
    },
    "front-lever": {
      "name": "Передний вис",
      "description": "Продвинутый гимнастический элемент, при котором тело удерживается параллельно земле лицом вверх, вися на перекладине, требуя огромной силы спины и кора."
    },
    "glute-squeezes-isometric": {
      "name": "Изометрическое сжатие ягодиц",
      "description": "Простое активирующее упражнение, включающее сознательное сжатие и удержание ягодичных мышц, часто выполняется в рамках разминки."
    },
    "half-turkish-get-up": {
      "name": "Половинный турецкий подъем",
      "description": "Первая часть полного турецкого подъема, переход из положения лежа в положение сидя с весом над головой. Отлично подходит для стабильности кора и плеч."
    },
    "handstand": {
      "name": "Стойка на руках",
      "description": "Действие по удержанию тела в стабильном, перевернутом вертикальном положении путем балансировки на руках."
    },
    "handstand-push-up": {
      "name": "Отжимания в стойке на руках",
      "description": "Продвинутое жимовое упражнение, выполняемое из стойки на руках, нацеленное на плечи и трицепсы."
    },
    "heel-slides": {
      "name": "Скольжение пяткой",
      "description": "Мягкое реабилитационное упражнение для сгибания колена, выполняемое путем скольжения пяткой к себе и от себя в положении сидя или лежа."
    },
    "hip-flexor-stretch": {
      "name": "Растяжка сгибателей бедра",
      "description": "Растяжка, нацеленная на мышцы передней части бедра, обычно выполняется в положении на одном колене."
    },
    "incline-chest-press-machine": {
      "name": "Жим на грудь в наклоне (в тренажере)",
      "description": "Упражнение на тренажере, которое нацелено на верхние грудные мышцы с помощью направленного жимового движения вверх."
    },
    "indian-club-double-circles": {
      "name": "Двойные круги с индийскими булавами",
      "description": "Упражнение на координацию и подвижность с использованием двух индийских булав, которые вращаются по круговым траекториям для улучшения здоровья и диапазона движений плеч."
    },
    "indian-club-heart-shapes": {
      "name": "«Сердечки» с индийскими булавами",
      "description": "Ритмичное упражнение с индийскими булавами, при котором булавы вращаются по траектории, напоминающей сердце, способствуя подвижности плеч и координации."
    },
    "inverted-row": {
      "name": "Австралийские подтягивания",
      "description": "Упражнение для спины с собственным весом, при котором вы висите под перекладиной и подтягиваете грудь к ней, часто считается подготовительным к подтягиваниям."
    },
    "jump-squat": {
      "name": "Приседания с выпрыгиванием",
      "description": "Плиометрическое упражнение, сочетающее приседание с вертикальным прыжком для развития мощности и взрывной силы нижней части тела."
    },
    "kettlebell-360-mace-style": {
      "name": "Вращение гири на 360 (в стиле булавы)",
      "description": "Вращательное упражнение, имитирующее вращение стальной булавы на 360, при котором гиря вращается вокруг головы для развития силы плеч и кора."
    },
    "kettlebell-arm-bar": {
      "name": "Армбар с гирей",
      "description": "Упражнение на стабильность и подвижность плеч, при котором вы лежите на боку, балансируя гирей над головой с прямой рукой."
    },
    "kettlebell-bent-press": {
      "name": "Наклонный жим с гирей",
      "description": "Классический силовой подъем, включающий жим гири над головой с одновременным наклоном в сторону, используя силу кора и спины."
    },
    "kettlebell-bicep-curl": {
      "name": "Сгибание на бицепс с гирей",
      "description": "Изолирующее упражнение для бицепсов, выполняемое путем сгибания руки с гирей. Может выполняться стандартным или сдавливающим хватом."
    },
    "kettlebell-bottoms-up-carry": {
      "name": "Прогулка с гирей дном вверх",
      "description": "Прогулка с отягощением, при которой гиря удерживается вверх дном, бросая вызов хвату, вращательной манжете и стабильности кора."
    },
    "kettlebell-bottoms-up-clean": {
      "name": "Взятие гири на грудь дном вверх",
      "description": "Взятие гири на грудь с фиксацией в перевернутом положении, требующее невероятного напряжения и контроля."
    },
    "kettlebell-bottoms-up-press": {
      "name": "Жим гири дном вверх",
      "description": "Строгий жим, выполняемый с гирей, удерживаемой вверх дном, отлично подходит для развития стабильности плеч и механики жима."
    },
    "kettlebell-cheat-row": {
      "name": "Тяга гири в наклоне с читингом",
      "description": "Тяжелая тяга в наклоне, которая использует легкое движение тела или инерцию для подъема большего веса, чем это возможно при строгой технике."
    },
    "kettlebell-clean-and-jerk-single-arm": {
      "name": "Толчок гири одной рукой",
      "description": "Классический подъем гири, включающий взятие гири на грудь и затем выталкивание ее над головой мощным толчком."
    },
    "kettlebell-clean-ohp-complex": {
      "name": "Комплекс: взятие и жим гири",
      "description": "Комплекс, который сочетает взятие гири одной рукой на грудь с последующим жимом над головой в каждом повторении."
    },
    "kettlebell-close-grip-floor-press": {
      "name": "Жим гири узким хватом лежа на полу",
      "description": "Вариант жима лежа на полу, выполняемый с одной гирей, удерживаемой обеими руками узким хватом, нацеленный на трицепсы и внутреннюю часть груди."
    },
    "kettlebell-cossack-squat": {
      "name": "Казачий присед с гирей",
      "description": "Боковой присед, который развивает подвижность тазобедренных суставов и силу одной ноги, выполняется путем приседания в сторону с гирей, часто в положении «кубок»."
    },
    "kettlebell-crush-grip-curl": {
      "name": "Сгибание со сдавливающим хватом гири",
      "description": "Сгибание на бицепс, при котором гиря удерживается за ядро (сдавливая ее между руками) для увеличения изометрического напряжения в груди и руках."
    },
    "kettlebell-crush-grip-floor-press": {
      "name": "Жим гири сдавливающим хватом лежа на полу",
      "description": "Жим лежа на полу, выполняемый с гирей, удерживаемой за ядро обеими руками, с акцентом на грудь и трицепсы."
    },
    "kettlebell-curtsy-lunge": {
      "name": "Выпад «реверанс» с гирей",
      "description": "Вариант выпада, при котором задняя нога скрещивается за передней, нацеливаясь на среднюю ягодичную мышцу и внутреннюю поверхность бедер, часто выполняется с гирей."
    },
    "kettlebell-dead-bug-pullover": {
      "name": "«Мертвый жук» с пуловером с гирей",
      "description": "Упражнение для кора, сочетающее движение «мертвый жук» с пуловером с гирей, бросая вызов координации и стабильности."
    },
    "kettlebell-dead-clean": {
      "name": "Взятие гири на грудь с мертвой точки",
      "description": "Взятие гири на грудь, начинающееся с мертвой точки на полу в каждом повторении, развивая взрывную силу с нуля."
    },
    "kettlebell-dead-swing": {
      "name": "Мах гирей с мертвой точки",
      "description": "Мах гирей, при котором каждое повторение начинается с мертвой точки на полу, фокусируясь на создании максимальной мощности для каждого маха."
    },
    "kettlebell-deadstop-swing": {
      "name": "Мах с мертвой остановкой",
      "description": "Также известный как «мертвый мах», этот вариант начинает каждое повторение с пола для развития взрывного движения тазом без использования инерции."
    },
    "kettlebell-deck-front-roll": {
      "name": "Перекат вперед с гирей",
      "description": "Динамичное движение, сочетающее перекат назад в присед на спине с использованием гири в качестве противовеса для вставания и перехода в перекат вперед."
    },
    "kettlebell-deck-squat": {
      "name": "Присед с перекатом на спину с гирей",
      "description": "Упражнение, в котором вы выполняете приседание, перекатываетесь на спину, а затем используете инерцию и вес гири, чтобы вернуться в положение стоя."
    },
    "kettlebell-double-farmers-walk": {
      "name": "Фермерская прогулка с двумя гирями",
      "description": "Упражнение для всего тела, при котором вы идете на расстояние, держа в каждой руке тяжелую гирю."
    },
    "kettlebell-double-hand-deadlift": {
      "name": "Тяга гири двумя руками",
      "description": "Тяга с одной гирей, удерживаемой обеими руками, отлично подходит для изучения тазобедренного шарнира."
    },
    "kettlebell-double-hand-swing": {
      "name": "Мах гирей двумя руками",
      "description": "Базовый мах гирей, выполняемый с одной гирей, удерживаемой обеими руками."
    },
    "kettlebell-double-overhead-squat": {
      "name": "Приседания с двумя гирями над головой",
      "description": "Продвинутый вариант приседаний, требующий значительной подвижности и стабильности, выполняется с двумя гирями, зафиксированными над головой."
    },
    "kettlebell-double-shrug": {
      "name": "Шраги с двумя гирями",
      "description": "Упражнение для укрепления трапециевидных мышц, выполняемое путем пожимания плечами с тяжелой гирей в каждой руке."
    },
    "kettlebell-figure-eight-to-hold": {
      "name": "Восьмерка с гирей с удержанием",
      "description": "Вариант восьмерки с гирей, в котором движение приостанавливается и удерживается спереди, бросая вызов кору и хвату изометрически."
    },
    "kettlebell-floor-skullcrusher": {
      "name": "Французский жим с гирей лежа на полу",
      "description": "Упражнение на разгибание трицепсов, выполняемое лежа на полу; одна или две гири опускаются к голове."
    },
    "kettlebell-get-up-sit-up": {
      "name": "Подъем корпуса из турецкого подъема с гирей",
      "description": "Начальная фаза подъема корпуса в турецком подъеме, отлично подходит для развития силы кора и стабильности с весом над головой."
    },
    "kettlebell-glute-bridge-with-floor-press": {
      "name": "Ягодичный мост с жимом гири лежа",
      "description": "Комбинированное упражнение, в котором вы удерживаете ягодичный мост, выполняя поочередный или двойной жим гири лежа на полу."
    },
    "kettlebell-goblet-alternating-reverse-lunge": {
      "name": "Обратные выпады с гирей у груди (поочередно)",
      "description": "Обратные выпады, выполняемые с гирей в положении «кубок», с чередованием ног в каждом повторении."
    },
    "kettlebell-goblet-clean": {
      "name": "Взятие гири на грудь в положение «кубок»",
      "description": "Вариант взятия на грудь, при котором гиря поднимается в положение для приседа «кубок», удерживаемая двумя руками на уровне груди."
    },
    "kettlebell-goblet-squat-with-curl": {
      "name": "Присед «кубок» со сгибанием на бицепс",
      "description": "Комплекс, в котором присед «кубок» сочетается со сгибанием на бицепс в верхней точке движения."
    },
    "kettlebell-goblet-walk": {
      "name": "Ходьба с гирей у груди",
      "description": "Прогулка с отягощением, при которой вы идете, держа гирю в положении «кубок», развивая стабильность кора и выносливость верхней части тела."
    },
    "kettlebell-good-morning-squat": {
      "name": "Наклон «Доброе утро» с переходом в присед с гирей",
      "description": "Гибридное упражнение, которое начинается с наклона «доброе утро» (тазобедренный шарнир), а затем переходит в глубокий присед, часто с гирей в положении «кубок»."
    },
    "kettlebell-gorilla-clean": {
      "name": "Взятие на грудь «горилла» с гирей",
      "description": "Взрывное взятие на грудь, выполняемое из глубокого приседа/наклона, часто с двумя гирями и поочередно."
    },
    "kettlebell-half-kneeling-halo": {
      "name": "Нимб с гирей с колена",
      "description": "Нимб с гирей, выполняемый из положения на одном колене для увеличения нагрузки на стабильность кора и изоляции плечевого пояса."
    },
    "kettlebell-half-kneeling-press": {
      "name": "Жим с колена с гирей",
      "description": "Жим над головой, выполняемый из положения на одном колене для нагрузки на стабильность кора и предотвращения использования ног."
    },
    "kettlebell-halifax": {
      "name": "Галифакс с гирей",
      "description": "Сложный комплекс с гирей, который обычно сочетает в себе взятие на грудь, приседание и вращательный жим."
    },
    "kettlebell-hang-clean": {
      "name": "Взятие гири на грудь с виса",
      "description": "Взятие гири на грудь, которое начинается из положения «виса» (после первого маха), а не с мертвой точки на полу."
    },
    "kettlebell-jefferson-curl": {
      "name": "Сгибание Джефферсона с гирей",
      "description": "Растяжка с отягощением для сгибания позвоночника с использованием гири для улучшения гибкости задней цепи и подвижности позвоночника."
    },
    "kettlebell-lateral-lunge": {
      "name": "Боковой выпад с гирей",
      "description": "Выпад в сторону с гирей (часто в положении «кубок» или на груди) для проработки внутренней и внешней поверхности бедер и улучшения подвижности тазобедренных суставов."
    },
    "kettlebell-lunge-pass-through": {
      "name": "Выпад с передачей гири под ногой",
      "description": "Вариант выпада, который включает передачу гири под передней ногой, бросая вызов координации и стабильности кора."
    },
    "kettlebell-lying-triceps-extension": {
      "name": "Разгибание на трицепс лежа с гирей",
      "description": "Изолирующее упражнение для трицепсов, выполняемое лежа на скамье или на полу; одна или две гири разгибаются из-за головы."
    },
    "kettlebell-outside-swing": {
      "name": "Мах гирей снаружи ноги",
      "description": "Вариант маха, при котором гиря движется снаружи ноги, а не между ног."
    },
    "kettlebell-pistol-squat-double": {
      "name": "Приседание «пистолетик» с двумя гирями",
      "description": "Продвинутое приседание на одной ноге, выполняемое с двумя гирями в положении на груди."
    },
    "kettlebell-pistol-squat-single": {
      "name": "Приседание «пистолетик» с одной гирей",
      "description": "Приседание на одной ноге, выполняемое с одной гирей в положении «кубок» в качестве противовеса."
    },
    "kettlebell-plank-drag-pull-through": {
      "name": "Перетаскивание гири в планке",
      "description": "Упражнение для кора на анти-ротацию, при котором вы стоите в планке и перетаскиваете гирю с одной стороны тела на другую."
    },
    "kettlebell-pullover-to-sit-up-to-press": {
      "name": "Комплекс: пуловер, подъем корпуса и жим с гирей",
      "description": "Сложное движение, сочетающее пуловер, подъем корпуса и жим над головой в одной плавной последовательности."
    },
    "kettlebell-rack-carry": {
      "name": "Прогулка с гирями на груди",
      "description": "Прогулка с отягощением, при которой вы идете, держа одну или две гири в положении на груди, развивая силу кора и верха спины."
    },
    "kettlebell-rack-walk": {
      "name": "Ходьба с гирями на груди",
      "description": "Другое название для прогулки с гирями на груди, с акцентом на ходьбу на расстояние или время."
    },
    "kettlebell-rotational-deadlift": {
      "name": "Вращательная тяга с гирей",
      "description": "Вариант тяги, который включает вращение туловища для подъема гири, расположенной сбоку от тела."
    },
    "kettlebell-rotational-swing": {
      "name": "Вращательный мах гирей",
      "description": "Мах гирей с вращательным компонентом, при котором бедра и туловище поворачиваются во время движения."
    },
    "kettlebell-row-to-deadlift-complex": {
      "name": "Комплекс: тяга гири к поясу и становая тяга",
      "description": "Последовательность, включающая становую тягу с гирей, за которой сразу следует тяга в наклоне."
    },
    "kettlebell-side-press": {
      "name": "Боковой жим с гирей",
      "description": "Классический вариант жима, при котором вы отклоняетесь от гири, чтобы получить механическое преимущество для жима ее над головой."
    },
    "kettlebell-single-arm-clean-and-thruster": {
      "name": "Взятие и трастер с одной гирей",
      "description": "Комплекс, сочетающий взятие одной рукой, приседание и жим над головой в одном мощном, плавном движении."
    },
    "kettlebell-single-arm-complex-clean-squat-press": {
      "name": "Комплекс с одной гирей (взятие-присед-жим)",
      "description": "Последовательность из взятия одной рукой, приседания и жима над головой, выполняемая без опускания гири."
    },
    "kettlebell-single-arm-deadlift": {
      "name": "Тяга одной гири",
      "description": "Тяга, выполняемая путем подъема одной гири одной рукой, бросая вызов анти-ротации и силе хвата."
    },
    "kettlebell-single-arm-overhead-squat": {
      "name": "Приседание с одной гирей над головой",
      "description": "Приседание, выполняемое с одной гирей, зафиксированной над головой, требующее исключительной подвижности и стабильности."
    },
    "kettlebell-single-arm-shrug": {
      "name": "Шраги с одной гирей",
      "description": "Односторонние шраги, выполняемые с тяжелой гирей для проработки трапециевидной мышцы с одной стороны."
    },
    "kettlebell-single-arm-thruster": {
      "name": "Трастер с одной гирей",
      "description": "Комбинированное упражнение, сочетающее присед с гирей на груди одной рукой и жим над головой."
    },
    "kettlebell-single-leg-deadlift": {
      "name": "Тяга на одной ноге с гирей",
      "description": "Одностороннее движение в тазобедренном суставе, которое бросает вызов равновесию, стабильности и силе задней цепи, выполняется с гирей."
    },
    "kettlebell-slingshot": {
      "name": "Передачи гири вокруг корпуса",
      "description": "Разминочное и координационное упражнение, включающее передачу гири вокруг тела из руки в руку."
    },
    "kettlebell-slingshot-to-goblet-squat": {
      "name": "Передачи гири с приседом «кубок»",
      "description": "Связка, которая сочетает передачи гири вокруг корпуса с приседом «кубок» в каждом повторении."
    },
    "kettlebell-snatch-to-overhead-reverse-lunge": {
      "name": "Рывок гири с обратным выпадом с гирей над головой",
      "description": "Комплекс, в котором вы выполняете рывок гири, а затем обратный выпад, удерживая гирю стабильно над головой."
    },
    "kettlebell-snatch-to-reverse-lunge": {
      "name": "Рывок гири с обратным выпадом",
      "description": "Комплекс, сочетающий рывок гири с обратным выпадом. Выпад можно делать с гирей на груди или над головой."
    },
    "kettlebell-somersault-squat": {
      "name": "Приседание «сальто» с гирей",
      "description": "Продвинутый вариант приседаний, включающий перекатывание гири через плечо во время приседания, бросая вызов подвижности и координации."
    },
    "kettlebell-sots-press": {
      "name": "Жим Сотса с гирей",
      "description": "Жим над головой, выполняемый из нижней точки глубокого приседа, требующий невероятной подвижности, стабильности и силы."
    },
    "kettlebell-sport-style-swing": {
      "name": "Мах в гиревом спорте",
      "description": "Более эффективный, маятнико-подобный мах, используемый в соревнованиях по гиревому спорту, разработанный для выносливости, а не максимальной мощности."
    },
    "kettlebell-stacked-stance-deadlift": {
      "name": "Тяга с гирей в разной постановке ног",
      "description": "Вариант тяги с разной постановкой ног (одна нога немного позади другой) для увеличения нагрузки на переднюю ногу."
    },
    "kettlebell-standing-pullover": {
      "name": "Пуловер с гирей стоя",
      "description": "Упражнение на подвижность и силу для широчайших и зубчатых мышц, выполняемое путем опускания гири за голову в положении стоя."
    },
    "kettlebell-straight-leg-sit-up": {
      "name": "Подъем корпуса с прямыми ногами и гирей",
      "description": "Подъем корпуса с отягощением, выполняемый с прямыми ногами, держа гирю у груди или над головой."
    },
    "kettlebell-suitcase-farmers-carry": {
      "name": "Прогулка «чемодан»/«фермер» с гирей",
      "description": "Прогулка с отягощением, выполняемая с гирей в одной руке («чемодан») или в обеих руках («фермер»), развивая хват, кор и осанку."
    },
    "kettlebell-sumo-deadlift-high-pull": {
      "name": "Тяга сумо с протяжкой с гирей",
      "description": "Взрывное движение, сочетающее тягу сумо с мощной протяжкой, развивая мощность всего тела."
    },
    "kettlebell-swing-to-snatch": {
      "name": "Мах гири с переходом в рывок",
      "description": "Упражнение, которое помогает изучить рывок, разбивая его на мах с последующим подрывом и фиксацией."
    },
    "kettlebell-tactical-lunge": {
      "name": "Тактический выпад с гирей",
      "description": "Вариант выпада, который часто включает передачу под ногой или другое координированное движение, подчеркивая атлетизм и контроль."
    },
    "kettlebell-tall-kneeling-press": {
      "name": "Жим с колен с гирей",
      "description": "Жим над головой, выполняемый стоя на обоих коленях, что задействует ягодицы и кор для создания стабильной основы."
    },
    "kettlebell-tate-press": {
      "name": "Жим Тейта с гирями",
      "description": "Жим на трицепс, при котором гири опускаются к груди с разведенными локтями, аналогично версии с гантелями."
    },
    "kettlebell-towel-curl": {
      "name": "Сгибание на бицепс с полотенцем и гирей",
      "description": "Сгибание на бицепс с использованием полотенца, продетого через ручку гири, для нагрузки на силу хвата."
    },
    "kettlebell-turkish-sit-up": {
      "name": "Турецкий подъем корпуса с гирей",
      "description": "Часть турецкого подъема, включающая подъем корпуса; мощное упражнение для кора и сгибателей бедра."
    },
    "kettlebell-two-hand-bottoms-up-squat": {
      "name": "Приседание с гирей дном вверх двумя руками",
      "description": "Приседание, выполняемое с гирей, удерживаемой вверх дном двумя руками, требующее огромного напряжения всего тела."
    },
    "kettlebell-upright-row": {
      "name": "Протяжка с гирей",
      "description": "Упражнение, нацеленное на плечи и трапеции, путем подтягивания одной или двух гирь к подбородку."
    },
    "kettlebell-waiters-walk": {
      "name": "Прогулка официанта с гирей",
      "description": "Односторонняя прогулка с отягощением, держа гирю прямо над головой, как будто неся поднос. Развивает стабильность плеч и кора."
    },
    "l-sit": {
      "name": "Уголок",
      "description": "Гимнастическое упражнение, в котором тело удерживается в форме буквы «L», опираясь на руки, в то время как ноги вытянуты прямо. Требует значительной силы кора и трицепсов."
    },
    "leg-raises": {
      "name": "Подъемы ног",
      "description": "Упражнение для кора, нацеленное на нижнюю часть пресса, выполняется лежа на спине с подъемом ног к потолку."
    },
    "lower-trunk-rotations-supine": {
      "name": "Вращения тазом лежа",
      "description": "Мягкое упражнение на подвижность для нижней части спины, выполняется лежа на спине со согнутыми коленями и вращением ног из стороны в сторону."
    },
    "lying-leg-curl-machine": {
      "name": "Сгибание ног лежа (в тренажере)",
      "description": "Изолирующее упражнение для бицепсов бедра, выполняемое на тренажере лицом вниз."
    },
    "macebell-10-to-2": {
      "name": "Махи булавой «10-на-2»",
      "description": "Базовое упражнение с булавой, включающее маятниковые махи перед собой из стороны в сторону, подобно движению стрелок часов с 10 на 2."
    },
    "macebell-360": {
      "name": "Вращение булавы на 360",
      "description": "Фирменное упражнение с булавой, включающее вращение булавы по полному кругу вокруг головы, развивая хват, силу плеч и кора."
    },
    "macebell-gravedigger": {
      "name": "«Могильщик» с булавой",
      "description": "Вращательное упражнение, имитирующее движение копания лопатой, нацеленное на кор и улучшающее вращательную мощность."
    },
    "macebell-spear-stab": {
      "name": "«Удар копьем» с булавой",
      "description": "Упражнение для всего тела, имитирующее удар копьем, включающее мощный выпад булавой вперед."
    },
    "machine-chest-press": {
      "name": "Жим на грудь в тренажере",
      "description": "Комбинированное упражнение для груди, похожее на жим лежа, но с фиксированной траекторией движения, обеспечиваемой тренажером."
    },
    "machine-hip-abduction": {
      "name": "Отведение бедра в тренажере",
      "description": "Изолирующее упражнение на тренажере для внешней поверхности бедер и средней ягодичной мышцы путем разведения ног против сопротивления."
    },
    "machine-hip-adduction": {
      "name": "Приведение бедра в тренажере",
      "description": "Изолирующее упражнение на тренажере для внутренней поверхности бедер путем сведения ног против сопротивления."
    },
    "machine-lateral-raise": {
      "name": "Боковые подъемы в тренажере",
      "description": "Изолирующее упражнение для средних дельт с использованием тренажера, который обеспечивает фиксированную траекторию для боковых подъемов."
    },
    "military-press-barbell": {
      "name": "Армейский жим со штангой",
      "description": "Строгий жим штанги над головой, выполняемый стоя, без помощи ног. Это фундаментальный тест силы плеч."
    },
    "muscle-up": {
      "name": "Выход силой",
      "description": "Продвинутый гимнастический навык, сочетающий подтягивание с отжиманием в одном плавном движении для перехода из виса под перекладиной или кольцами в упор над ними."
    },
    "parallette-deep-push-up": {
      "name": "Глубокие отжимания на паралетсах",
      "description": "Отжимания, выполняемые на паралетсах, что позволяет увеличить диапазон движения и глубже растянуть грудь."
    },
    "parallette-l-sit": {
      "name": "Уголок на паралетсах",
      "description": "Уголок, выполняемый на паралетсах, что может быть немного легче, чем на полу, так как обеспечивает больше пространства для ног."
    },
    "parallette-shoot-through": {
      "name": "Пронос ног на паралетсах",
      "description": "Динамичное гимнастическое движение на паралетсах, переход из планки или отжимания в группировку или уголок путем «проноса» ног между руками."
    },
    "parallette-tuck-planche": {
      "name": "Планш в группировке на паралетсах",
      "description": "Прогрессия к полному планшу, выполняемая на паралетсах, при которой тело поддерживается руками с коленями, поджатыми к груди."
    },
    "pelvic-tilts": {
      "name": "Наклоны таза",
      "description": "Упражнение на активацию кора и подвижность позвоночника, включающее наклоны таза вперед и назад, часто выполняется лежа на спине."
    },
    "pike-push-up": {
      "name": "Отжимания в «щучке»",
      "description": "Вариант отжиманий, выполняемый с высоко поднятым тазом в форме перевернутой «V», что смещает акцент на плечи. Прогрессия к отжиманиям в стойке на руках."
    },
    "piriformis-stretch-supine": {
      "name": "Растяжка грушевидной мышцы лежа",
      "description": "Растяжка для грушевидной мышцы в бедре, выполняется лежа на спине, часто путем скрещивания одной лодыжки над противоположным коленом и подтягивания к груди."
    },
    "pistol-squat": {
      "name": "Приседание «пистолетик»",
      "description": "Продвинутое упражнение с собственным весом, состоящее из приседания на одной ноге, требующее значительной силы, равновесия и подвижности."
    },
    "planche": {
      "name": "Планш",
      "description": "Продвинутый гимнастический навык, при котором тело удерживается параллельно земле, опираясь только на руки, требуя невероятной силы прямых рук и равновесия."
    },
    "plank-to-push-up": {
      "name": "Переход из планки в упор лежа",
      "description": "Динамичное упражнение, в котором вы чередуете планку на предплечьях и высокую планку (положение для отжиманий), бросая вызов стабильности кора и силе верхней части тела."
    },
    "proprioceptive-close-grip-push-up": {
      "name": "Проприоцептивные отжимания узким хватом",
      "description": "Отжимания узким хватом, выполняемые на неустойчивой поверхности для развития стабильности, контроля и осознания тела."
    },
    "proprioceptive-pause-goblet-squat": {
      "name": "Проприоцептивные приседания «кубок» с паузой",
      "description": "Приседания «кубок» с паузой внизу, часто выполняемые с закрытыми глазами или на неустойчивой поверхности для усиления проприоцепции и стабильности."
    },
    "quad-sets-isometric": {
      "name": "Изометрическое напряжение квадрицепса",
      "description": "Изометрическое упражнение для укрепления квадрицепсов, включающее сокращение мышцы без движения в коленном суставе. Часто используется на ранних стадиях реабилитации."
    },
    "ring-archer-pull-up": {
      "name": "Подтягивания лучника на кольцах",
      "description": "Односторонний вариант подтягиваний на гимнастических кольцах, при котором одна рука тянет, а другая вытягивается в сторону, подобно лучнику, натягивающему лук."
    },
    "ring-dip": {
      "name": "Отжимания на кольцах",
      "description": "Отжимания, выполняемые на гимнастических кольцах, что добавляет компонент нестабильности, требующий большей силы и стабилизации от плеч и груди."
    },
    "ring-muscle-up": {
      "name": "Выход силой на кольцах",
      "description": "Выход силой, выполняемый на гимнастических кольцах, что позволяет более естественный переход благодаря движению колец."
    },
    "ring-row": {
      "name": "Тяга на кольцах",
      "description": "Австралийские подтягивания с использованием гимнастических колец, позволяющие естественное вращение кистей и регулируемую сложность путем изменения угла наклона тела."
    },
    "ring-skin-the-cat": {
      "name": "«Сдирание кошки» на кольцах",
      "description": "Основное упражнение на подвижность в гимнастике на кольцах, включающее пронос ног и таза через руки и над головой в вис, а затем возвращение."
    },
    "ring-support-hold": {
      "name": "Удержание в упоре на кольцах",
      "description": "Базовое изометрическое удержание на гимнастических кольцах, при котором вы поддерживаете свой вес на прямых руках, требуя значительной стабилизации."
    },
    "sandbag-bear-hug-squat": {
      "name": "Приседания с мешком в обхвате",
      "description": "Приседания, выполняемые с обхватом мешка вертикально у туловища, интенсивно задействуя кор и верх спины."
    },
    "sandbag-clean": {
      "name": "Взятие мешка на плечо",
      "description": "Взрывное упражнение, при котором мешок поднимается с пола на плечо одним мощным движением."
    },
    "sandbag-over-the-shoulder-carry": {
      "name": "Прогулка с мешком через плечо",
      "description": "Прогулка с отягощением, при которой тяжелый мешок переносится через одно плечо, бросая вызов кору и задней цепи."
    },
    "sandbag-rotational-lunge": {
      "name": "Вращательные выпады с мешком",
      "description": "Выпад, который включает вращение туловища, с удержанием мешка для добавления сопротивления и нагрузки на кор."
    },
    "sandbag-shouldering": {
      "name": "Забрасывание мешка на плечо",
      "description": "Действие по подъему мешка с пола и размещению его на одном плече, фундаментальный навык в стронгмене и работе с нестандартными снарядами."
    },
    "sandbag-zercher-squat": {
      "name": "Приседания Зерхера с мешком",
      "description": "Приседания, выполняемые с мешком в сгибе локтей, что сильно нагружает кор, верх спины и руки."
    },
    "scapular-retraction-shoulder-blade-squeezes": {
      "name": "Сведение лопаток",
      "description": "Упражнение для осанки, сфокусированное на сведении лопаток вместе для укрепления ромбовидных и средних трапециевидных мышц."
    },
    "seated-hamstring-stretch": {
      "name": "Растяжка бицепса бедра сидя",
      "description": "Растяжка для бицепсов бедра, выполняемая из положения сидя, обычно путем наклона к носкам с прямыми ногами."
    },
    "seated-pec-deck-fly": {
      "name": "Разведение в тренажере «бабочка» сидя",
      "description": "Изолирующее упражнение для груди с использованием тренажера, где вы сидите и сводите мягкие рычаги вместе движением, похожим на разведение."
    },
    "shoulder-external-rotation-banded": {
      "name": "Наружное вращение плеча с резинкой",
      "description": "Профилактическое/реабилитационное упражнение для мышц вращательной манжеты, использующее эспандер для вращения руки наружу против сопротивления."
    },
    "shoulder-pendulum-swings": {
      "name": "Маятниковые махи плечом",
      "description": "Мягкое упражнение на диапазон движений для плечевого сустава, часто используемое на ранних стадиях реабилитации, включающее наклон и мягкое раскачивание руки."
    },
    "shrimp-squat": {
      "name": "Приседание «креветка»",
      "description": "Вариант приседания на одной ноге, при котором нерабочая нога согнута и удерживается за телом, похоже на «пистолетик», но с другим положением ноги."
    },
    "side-plank": {
      "name": "Боковая планка",
      "description": "Изометрическое упражнение для кора, выполняемое на одном боку для проработки косых мышц и улучшения боковой стабильности."
    },
    "single-kettlebell-alternating-swing": {
      "name": "Поочередный мах одной гирей",
      "description": "Мах гирей, при котором гиря передается из одной руки в другую в верхней точке каждого маха."
    },
    "single-kettlebell-clean-and-press-to-pause-windmill": {
      "name": "Комплекс: взятие, жим и мельница с паузой (одна гиря)",
      "description": "Сложная связка, сочетающая взятие на грудь, жим, а затем мельницу с паузой, бросая вызов силе, стабильности и подвижности."
    },
    "single-kettlebell-clean-and-press": {
      "name": "Взятие и жим одной гири",
      "description": "Классическая комбинация, при которой гиря берется на грудь, а затем немедленно выжимается над головой."
    },
    "single-kettlebell-figure-eight": {
      "name": "Восьмерка с одной гирей",
      "description": "Динамичное упражнение, которое улучшает координацию, стабильность кора и силу хвата путем передачи гири между и вокруг ног в форме восьмерки."
    },
    "single-kettlebell-front-squat": {
      "name": "Фронтальный присед с одной гирей",
      "description": "Приседание, выполняемое с одной гирей на груди, создавая смещенную нагрузку, которая бросает вызов стабильности кора."
    },
    "single-kettlebell-high-pull": {
      "name": "Протяжка одной гири",
      "description": "Взрывное упражнение, включающее подтягивание гири из маха до уровня подбородка, удерживая локоть высоко."
    },
    "single-kettlebell-jerk": {
      "name": "Толчок одной гири",
      "description": "Мощный подъем, при котором вы используете движение «швунг» ногами для выталкивания одной гири над головой."
    },
    "single-kettlebell-overhead-lunge": {
      "name": "Выпад с одной гирей над головой",
      "description": "Выпад, выполняемый с одной гирей, зафиксированной над головой, создавая значительную нагрузку на стабильность."
    },
    "single-kettlebell-overhead-press": {
      "name": "Жим одной гири над головой",
      "description": "Фундаментальное упражнение для силы верхней части тела, включающее жим одной гири из положения на груди до фиксации над головой."
    },
    "single-kettlebell-russian-twist": {
      "name": "Русский твист с одной гирей",
      "description": "Упражнение для кора, нацеленное на косые мышцы, выполняется сидя с поворотами туловища из стороны в сторону, держа одну гирю."
    },
    "single-kettlebell-swing": {
      "name": "Мах одной гирей",
      "description": "Мах гирей одной рукой, который добавляет анти-ротационную нагрузку к стандартному маху двумя руками."
    },
    "single-leg-stance-balance": {
      "name": "Стойка на одной ноге (баланс)",
      "description": "Базовое упражнение на равновесие, которое включает стояние на одной ноге в течение определенного времени."
    },
    "skater-jumps": {
      "name": "Прыжки конькобежца",
      "description": "Плиометрическое упражнение, которое включает боковые прыжки с одной ноги на другую, имитируя движение конькобежца для развития мощности и ловкости."
    },
    "slow-eccentric-floor-skullcrusher": {
      "name": "Французский жим на полу с медленной эксцентрикой",
      "description": "Французский жим, выполняемый на полу с акцентом на очень медленную, контролируемую фазу опускания (эксцентрическую)."
    },
    "slow-eccentric-floor-skullcrusher-to-close-grip-floor-press": {
      "name": "Комплекс: медленный французский жим и жим узким хватом на полу",
      "description": "Комплекс, ориентированный на трицепс, сочетающий медленный эксцентрический французский жим с жимом узким хватом на полу в каждом повторении."
    },
    "slow-eccentric-pause-towel-curls": {
      "name": "Сгибания с полотенцем, медленной эксцентрикой и паузой",
      "description": "Сгибание на бицепс с использованием полотенца для хвата, с акцентом на медленную фазу опускания и паузу для максимального времени под напряжением."
    },
    "standing-calf-raise": {
      "name": "Подъемы на носки стоя",
      "description": "Упражнение для укрепления икроножной мышцы путем подъема на пятках из положения стоя."
    },
    "dip": {
      "name": "Отжимания на прямой перекладине",
      "description": "Отжимания, выполняемые на одной прямой перекладине, требующие большей стабилизации кора и другого угла в плечах, чем отжимания на параллельных брусьях."
    },
    "straight-leg-raise": {
      "name": "Подъем прямых ног",
      "description": "Упражнение для кора и сгибателей бедра, выполняемое лежа на спине с подъемом одной или обеих ног прямо вверх, не сгибая коленей."
    },
    "suitcase-deadlift-to-anti-rotation-row": {
      "name": "Комплекс: тяга «чемодан» и анти-ротационная тяга",
      "description": "Комплекс, который сочетает тягу «чемодан» одной рукой с тягой вверху, бросая вызов кору для сопротивления вращению."
    },
    "superman-extensions": {
      "name": "Разгибания «Супермен»",
      "description": "Упражнение с собственным весом, которое укрепляет нижнюю часть спины, ягодицы и бицепсы бедра путем одновременного подъема рук и ног от пола в положении лежа на животе."
    },
    "terminal-knee-extension-tke": {
      "name": "Терминальное разгибание колена (TKE)",
      "description": "Реабилитационное и активирующее упражнение для квадрицепсов (особенно VMO), которое фокусируется на последних нескольких градусах разгибания колена, часто с использованием эспандера."
    },
    "towel-scrunches": {
      "name": "Скручивание полотенца пальцами ног",
      "description": "Упражнение для внутренних мышц стопы, выполняемое путем скручивания полотенца, лежащего на полу, с помощью пальцев ног."
    },
    "tuck-planche": {
      "name": "Планш в группировке",
      "description": "Базовая прогрессия к полному планшу, при которой тело балансирует на руках с коленями, плотно поджатыми к груди."
    },
    "twist-sit-up": {
      "name": "Скручивания с поворотом",
      "description": "Вариант скручиваний, который включает поворот туловища в верхней точке движения для задействования косых мышц."
    },
    "upper-trapezius-stretch": {
      "name": "Растяжка верхней трапеции",
      "description": "Растяжка шеи, выполняемая путем мягкого наклона головы в сторону для растяжения верхней трапециевидной мышцы."
    },
    "vipr-cylinder-drop-squat": {
      "name": "Приседания с броском цилиндра ViPR",
      "description": "Динамичное приседание с использованием ViPR, при котором цилиндр бросается и ловится, интегрируя движение и нагрузку."
    },
    "vipr-cylinder-lift": {
      "name": "Подъем цилиндра ViPR",
      "description": "Базовое упражнение с ViPR, которое включает подъем цилиндра в различных плоскостях движения, часто имитируя функциональные задачи."
    },
    "vipr-ice-skater": {
      "name": "«Конькобежец» с ViPR",
      "description": "Упражнение с боковым движением с использованием ViPR, которое имитирует движение конькобежца, развивая мощность и ловкость во фронтальной плоскости."
    },
    "vipr-lateral-shift-with-rip": {
      "name": "Боковое смещение с рывком ViPR",
      "description": "Динамичное упражнение, сочетающее боковое смещение ViPR с мощным толчково-тянущим движением «рывок»."
    },
    "vipr-shoveling": {
      "name": "«Копание» с ViPR",
      "description": "Вращательное упражнение для всего тела, имитирующее движение копания, развивая мощность и координацию через бедра и кор."
    },
    "vipr-thread-the-needle": {
      "name": "«Продеть нитку в иголку» с ViPR",
      "description": "Упражнение на подвижность и стабильность с использованием ViPR, включающее вращательное движение под телом для улучшения подвижности грудного отдела позвоночника."
    },
    "wall-handstand": {
      "name": "Стойка на руках у стены",
      "description": "Стойка на руках, выполняемая с опорой ногами на стену, используется для развития силы и уверенности для свободной стойки на руках."
    },
    "rehab-wall-push-up": {
      "name": "Отжимания от стены",
      "description": "Начальный вариант отжиманий, при котором вы отжимаетесь от стены, уменьшая поднимаемый вес тела."
    },
    "wall-sit": {
      "name": "Стульчик у стены",
      "description": "Изометрическое упражнение, в котором вы удерживаете положение приседа, прислонившись спиной к стене, в основном укрепляя квадрицепсы."
    },
    "rehab-wall-sit-isometric": {
      "name": "Изометрический стульчик у стены",
      "description": "Изометрическое упражнение, удерживающее положение приседа у стены для развития мышечной выносливости квадрицепсов, ягодиц и бицепсов бедра."
}
  }
}